{
    "headline": "MetLife launches new equity-linked product",
    "content": "MetLife India Insurance Company on Tuesday announced the launch of a new equity-linked insurance product, Met Smart Platinum, in line with the latest IRDA guidelines.\nIn a statement here, the company said Met Smart Platinum is a market linked product and is targeted at individuals to meet the changing financial needs at various stages in their life. The plan covers individuals till 99 years of age. “We have always designed products that meet the financial and protection requirements of customers. Met Smart Platinum also aligns with the recent IRDA ULIP regulations,” MetLife Managing Director Rajesh Relan said.\nThe product offers customers the option to choose the allocation of desired percentages of their investment between a high risk fund (Flexi Cap) and a low risk fund (Protector II) depending on their risk appetite, the statement added.\n“The flexibility offered to the customers by Met Smart Platinum allows them to make top-up investments apart from allowing partial withdrawals in case the customer needs emergency liquidity of funds. The plan also allows customers to increase and decrease the life coverage depending upon their changing lifestyle needs as they cross different stages of their life,'' the statement added.\nUnder the new IRDA guidelines effective from September 1, the commission paid to distributors and expenses charged by insurers will no longer be front-loaded and will be distributed over the lock-in period of the schemes, which has been raised to five years from three years earlier.\nThe new guidelines would protect ULIP-holders from mis-selling by agents and onerous commissions are likely to make the equity-linked instruments more investor-friendly.\nPublished - September 07, 2010 06:32 pm IST\ninsurance",
    "published_date": "7 Sept 2010",
    "year": 2010,
    "month": "September",
    "url": "https://www.thehindu.com/business/companies/MetLife-launches-new-equity-linked-product/article15906476.ece"
}