{
    "headline": "Life insurance companies to discuss SEBI order",
    "content": "Against the backdrop of Securities and Exchange Board of India banning 14 life insurers from selling unit linked insurance products (ULIPs), the insurers are likely to meet here on Monday to examine various options open to them for relief against the order.\nSEBI had, on Friday, banned 14 life insurance companies from selling ULIPs on the ground that they were akin to mutual funds and were launched without obtaining registration from it.\nThe insurance companies are likely to meet the Life Insurance Council on Monday to examine the various options including legal to counter the SEBI order.\nThe market regulator has banned 14 insurers — ICICI Prudential Life, Bharti AXA Life, Reliance Life, Aviva Life Bajaj Allianz Life, Birla Sun Life, Metlife Insurance, Tata AIG Life, Aegon Religare, HDFC Standard, Kotak Life, Max New York Life, ING Vyasa Life and SBI Life, from selling ULIPs. There is also speculation that SEBI would issue show casue notices to LIC and a few other life insurers for not seeking its approval before launching their ULIPs. SEBI has ordered all the 14 companies not to issue any offer document, advertisement, brochure soliciting money from investors or raise money by way of new and/or additional subscription for any product (including ULIPs) having an investment component in the nature of mutual funds, till they obtain the requisite certificate of registration from it.\nSEBI had issued notices to these life insurers on January 15 except HDFC Standard Life, which was issued notice in December last, asking why they had not obtained permission from it before launching ULIPs. SEBI's contention is that ULIPs offered by the life insurers are a combination of investment and insurance and, therefore, the investment component is in the nature of mutual funds which can only be offered or launched after obtaining registration from SEBI.\nLife insurers said that they have not yet received the SEBI order. Reacting to the SEBI's notice, insurance sector regulator, IRDA, said that ULIPs offered by different insurance companies are safe and secure and “the matter arising out of the recent orders of the SEBI would be addressed expeditiously in an appropriate forum in accordance with law.”\nPublished - April 11, 2010 12:58 am IST\neconomy, business and finance\n                    \n                            /                      \n                        \n                        insurance\n                    \n                            /                      \n                        \n                        financial and business service",
    "published_date": "11 Apr 2010",
    "year": 2010,
    "month": "April",
    "url": "https://www.thehindu.com/business/Life-insurance-companies-to-discuss-SEBI-order/article16365475.ece"
}