{
    "headline": "IRDA asks insurance companies to ignore SEBI order",
    "content": "Insurance regulator IRDA has taken SEBI head on by setting aside a ban on ULIP by the market watchdog and asking 14 life insurance companies to continue their business as usual.\nThe finance ministry has opted to keep a safe distance from the ongoing controversy.\nUnit-linked equity products (ULIPs) are insurance plans sold by life insurers where the money collected from consumers is invested into equity and debt markets and returns are linked to the same. Regulation of ULIPs has a bone of contention between the two regulators.\nMoving swiftly within 24 hours of SEBI order, IRDA Chairman J Hari Narayan in a signed order has asserted that it is IRDA which will control the ULIPs, which are issued by the insurance companies.\nEarlier on Friday, SEBI had banned 14 life insurance companies, including those belonging to the Tatas, Reliance Anil Ambani Group, SBI, ICICI Bank and HDFC, from issuing ULIP products.\nSEBI Chairman C.B. Bhave while speaking to reporters in Kolkata on Saturday declined to speak on the ban on 14 insurance companies from selling ULIP without its approval.\n“I am not going to comment on the order,” he had said.\nThe Securities and Exchange Board of India (SEBI) in its Friday evening order had also said that entities registered with SEBI could operate such schemes as they are in the nature of mutual funds.\nEven as the two regulators continue the turf war, Finance Secretary Ashok Chawla distanced himself from the controversy saying it was a matter between the two regulators. “It’s a matter between regulators, so they have to decide.”\nThe turf war concerns the nature of ULIPs which account for over 50 per cent of the total life insurance business in the country.\nAs on March 31, 2009, the total funds under the management of life insurance sector stood at over Rs 9 lakh crore of, accroding to the Life Insurance Council’s figure.\nThe life insurance companies against whom SEBI passed the order are SBI Life, ICICI Prudential, Tata AIG, Aegon Religare Life, Aviva Life, Bajaj Allianz, Bharti AXA, Birla Sunlife, HDFC Standard Life, ING Vysya Life, Kotak Mahindra Old Mutual Life, Max New York Life, Metlife India and Reliance Life.\nIRDA’s order, however, will provide some relief to these life insurance companies.\nThe order issued by SEBI banned 14 insurance companies from issuing \"any offer document, advertisement, brochure soliciting money from investors or raise money from investors by way of new and/or additional subscription for any product (including ULIPs) having an investment component in the nature of mutual funds, till they obtain the requisite certificate of registration from SEBI.\"\nWithing 24 hours of the SEBI's director, insurance regulator IRDA fought back with its own order that said, \"all the 14 insurance companies which are mentioned in the order of SEBI are directed to note that notwithstanding the said Order of the SEBI, they shall continue to carry out insurance business as usual including offering, marketing and servicing ULIPs in accordance with the Insurance Act.”\nDescribing the action of SEBI as \"wholly misconceived and without jurisdiction\", IRDA said it would have brought the insurance industry to a \"stand still\" seriously jeopardising the interests of the policy holders and the interests of the insurers.\nIt would have resulted in \"complete drying up of the revenue flows to the insurance companies which could disrupt the payment of benefits on maturity, on death and on other admissible claims, putting the policyholder and the general public to irreparable financial loss.\n\"The financial position of the insurers will be seriously jeopardized thus destabilizing the market and upsetting financial stability\", IRDA added.\nAbout 7.03 crore ULIP polices involving a total premium of Rs.90,645 crores were in force in 2008-09. As many as 16.7 lakhs policies were sold with a premium of Rs.44611 crores during April-February 2009-10.\nPublished - April 11, 2010 02:38 pm IST\ninsurance",
    "published_date": "11 Apr 2010",
    "year": 2010,
    "month": "April",
    "url": "https://www.thehindu.com/business/Industry/IRDA-asks-insurance-companies-to-ignore-SEBI-order/article16365559.ece"
}