{
    "headline": "ULIPs: lock-in period raised to 5 years",
    "content": "After winning the turf war with the Securities and Exchange Board of India over control over unit-linked insurance products (ULIPs), the Insurance Regulatory and Development Authority (IRDA) on Monday tightened the norms for these schemes by raising the lock-in period and raising the insurance cover on them.\nThe lock-in period for all ULIPs has been increased from three years to five years, including the top-up premiums, thereby making them long-term financial instruments, which basically provide risk protection, the IRDA said in the guidance note, released on Monday.\nBesides insurance cover on such products, the premium has gone up to 10 times of the first-year premium compared to existing five times.\nThe fight between SEBI and IRDA was basically on the issue whether ULIPs are investment product or insurance schemes. ULIPs are those insurance products the value of which are linked to market price of the stocks in which a part of those money is invested.\nIRDA tried to increase the insurance aspects of ULIPs. As was expected, commission and expenses have been reduced by evenly distributing it through out the lock-in period.\n“Charges on ULIPs are mandated to be evenly distributed during the lock-in period to ensure that high front-ending of expenses is eliminated,” IRDA said, adding that all limited premium ULIPs, other than single premium products, shall have premium paying term of at least five years.\nThe regulator said that insurers will provide a mortality cover or a health cover to all ULIPs, other than pension and annuity products, thereby increasing the risk cover component on them.\nCustomers to benefit\nCommenting on the guidelines, MetLife India Managing Director Rajesh Relan said, “prima facie the circular benefits the customer. This is yet another step taken by the IRDA to add more value to the policyholder and make the products more transparent. This will also improve persistency and provide long-term and sustainable income stream for distributors.”\nHowever, Mr. Relan pointed out, “the full impact of these steps on industry players is yet to be ascertained, as we would seek further clarifications on certain clauses.”\nAs per the new guidelines, all ULIP pension or annuity products will offer a minimum guaranteed return of 4.5 per cent annually or as specified by the IRDA from time-to-time. This will protect the life time savings of pensioners from any adverse market fluctuations at the time of maturity, the circular said. All insurers are directed to conform to these features so that they can introduce products with due approval from the IRDA. From September 1, all ULIPs shall conform to this circular, the regulator said.\nWith a view to smoothening the cap on charges, the capping been rationalised to ensure that the difference in yield is capped from the fifth year onwards, the notification said. This will not only reduce the overall charges on these products, but also smoothen the charge structure for the policyholder, it added.\nBesides, the IRDA has also amended regulations to further tighten the code of conduct of corporate agents to ensure that a customer does not deal with any unlicensed person. The regulations have also been amended to ensure that there is no scope for any kind of remuneration other than commission where sale has been effected, it said.\nThis measure will reduce the expenses of the insurer, thereby lowering premiums to be paid by the policyholder, it added.\nPublished - June 28, 2010 11:20 pm IST\neconomy (general)\n                    \n                            /                      \n                        \n                        economy, business and finance\n                    \n                            /                      \n                        \n                        insurance",
    "published_date": "28 Jun 2010",
    "year": 2010,
    "month": "June",
    "url": "https://www.thehindu.com/business/Economy/ULIPs-lock-in-period-raised-to-5-years/article16271171.ece"
}