{
    "headline": "In the league of winners",
    "content": "The National para badminton championship for the physically challenged showcased sportspersons with disabilities exhibiting their court craft in full measure and proving that they are not inferior to their able bodied counterparts.\nThe convenor of the championship and executive president of the Indian Badminton Sports Association of the Challenged, Y.K. Venkatesh, andsecretary general, Ramesh Tikaram were pleased with the response and interest shown in the tournament. “This is the 12 year that the championship has been conducted. It is getting bigger and better with each edition,” say the duo, who were also instrumental in conducting two international meets in Bangalore; the World Cup in 2002 and Asia Cup in 2006.\n“About 120 players from across the country participated in the meet. The matches were very competitive,” says Venkatesh. Though there are international class differently-abled players like Pramod Bhagatk, Nanoj Sarkar, Raj Kumar Satyam and Parul Parmar, the game lacks backing from the sponsor and the government. Para badminton comes under the wings of Paralympic Committee of India , but the PCI does nothing much to promote the game. “For the nationals, PCI has offered to sponsor only the medals, which cost about Rs.10,000 or Rs.15,000,” says Venkatesh. The Union Sports Ministry funds go to PCI and are not disbursed to individual federations.\n“We face massive problems in getting standard equipment and kits. When we conduct Nationals events, we have to provide them with boarding and lodging facilities, keeping in mind their special needs. Metlife sponsored us once. We have been depending on voluntary contributions. Sponsors are very apprehensive as they have not seen any of our players in action. We are trying to create better awareness, inviting them to watch our events,” says Venkatesh. Despite facing these hurdles, they soldier on.\n“We are recognized by the BWF, the world body for badminton. Our national event rankings are taken into consideration by them and an Indian team will be participating in the Asian championship in Korea later in October. Badminton will also find a place in the 2016 Rio Paralympics, which is bound to give big boost to the game,” says Venkatesh. He also hailed the media support for their cause. “It is the media coverage that spread awareness of such events in the rural areas. There are many positive signs.”\nPublished - September 12, 2012 07:25 pm IST\nbadminton\n                    \n                            /                      \n                        \n                        people\n                    \n                            /                      \n                        \n                        The Hindu MetroPlus",
    "published_date": "12 Sept 2012",
    "year": 2012,
    "month": "September",
    "url": "https://www.thehindu.com/sport/other-sports/in-the-league-of-winners/article3889114.ece"
}