{
    "headline": "Will achieve ambitious economic agenda by elections: Chidambaram",
    "content": "Union Finance Minister P. Chidambaram has assured global investors that their concerns over India’s economy will be put to rest and the government will achieve its “ambitious economic agenda” by next year’s Lok Sabha elections.\n“Global industry wants India to succeed. India will succeed. I know this past year has caused a lot of concern, but this year is over and by elections we will achieve our ambitious economic agenda,” Mr. Chidambaram said on Wednesday at a closed door meeting with investors hosted by the US-India Business Council (USIBC) in New York.\nMr. Chidambaram is currently touring US cities to attract foreign investment and sell India’s growth story to investors as India grapples with a high current account deficit.\n“India currently holds a record high current account deficit and FDI could be the key to closing that gap,” USIBC said in a statement.\nUSIBC said top global industry leaders discussed with the Finance Minister the opportunities that exist in India and candidly addressed some of the challenges companies face in the market which affects investor sentiment.\nThe CEOs of Fortune 100 companies discussed a range of issues including infrastructure, retail, agriculture, life sciences, financial services, legal services, and real estate.\n“We commend Minister Chidambaram for his leadership during these complex times. The American business community continues to look to India as a partner in the global economy ripe with investment opportunities.\n“My colleagues and I remain committed to working collaboratively with Government of India and Indian industry to identify innovative solutions to India’s challenges,” USIBC Chairman and MasterCard president & CEO Ajay Banga said.\nAmong those were present at the USIBC meeting included PepsiCo CEO Indra Nooyi, The McGraw Hill Companies President and CEO Harold McGraw Chairman, Goldman Sachs CEO Lloyd Blankfein, Amway President Doug DeVos, President of Emerging Markets, Pfizer Olivier Brandicourt and MetLife CFO John Hele.\nFounded in 1975, USIBC is a leading business advocacy association comprising nearly 400 of America’s and India’s top companies focused to enhancing the U.S.-India commercial relationship.\nPublished - April 18, 2013 02:46 pm IST\neconomy, business and finance",
    "published_date": "18 Apr 2013",
    "year": 2013,
    "month": "April",
    "url": "https://www.thehindu.com/business/Economy/will-achieve-ambitious-economic-agenda-by-elections-chidambaram/article4629904.ece"
}