{
    "headline": "Insurance repositories focus on  transactions for revenue",
    "content": "The revenue model of the newly licensed insurance repositories will be based on the number of transactions done. The repositories will be charging the insurance firms for each transaction done according to Viiveck Verma, Executive Director, Karvy Insurance Repository Limited.\nKarvy was one among the five firms licensed by the Insurance Regulatory and Development Authority (IRDA) to be the insurance repositories. The rest four are, NSDL Database management Limited, Central Insurance Repository Limited, SHCIL Projects Limited and CAMS Repository Services Limited.\n“There are over 42 crore policy holders in life and health insurance segments. We are ready with the best infrastructure possible to facilitate electronic services and transactions. Our unique selling point is our mobile platform for wider reach,” Viiveck said. As per T.S Vijayan, Chairman IRDA, the transaction charge by repositories could be around Rs 25.\nThe management cost of each policy is expected to come down from Rs. 120 per policy to Rs. 25 per annum according to Union Finance Minister P. Chidambaram who inaugurated the repositories in Hyderabad. The system enables policy holders buy and keep insurance policies in electronic form and eliminate paper and associated risks. The repositories will be paid directly by the insurers and policy holders are not charged.\nThis apart, the system enables customers take an informed decision according to Dr. Amarnath Ananthanarayanan, CEO & MD of Bharti AXA General Insurance Company Limited. “Customers can compare and evaluate the mutual funds and insurance policies and take a view through the system,” he said.\nThe insurance firms, on their part, have already started acting on the expected changes in the system. “We have already tied up with all the five players and started offering digital options to customers. We are ready with digital database and digital stamp,” said Rajesh Relan, MD and Country manager, PNB MetLife India. Repository system requires customers open an electronic Insurance Account (eIA) with the repository.\nPublished - September 18, 2013 02:45 am IST\nAndhra Pradesh\n                    \n                            /                      \n                        \n                        insurance",
    "published_date": "18 Sept 2013",
    "year": 2013,
    "month": "September",
    "url": "https://www.thehindu.com/news/national/andhra-pradesh/insurance-repositories-focus-on-transactions-for-revenue/article5139178.ece"
}