{
    "headline": "Junior Badminton Championships: Smit stuns Simran for title",
    "content": "Smit Toshniwal (Nashik) overcame favourite Simran Singhi (Mumbai) in girls U-15 category final, winning 21-15, 18-21, 21-15 at the PNB MetLife Junior Badminton Championship 2015 West Zone Tournament. Other age-group champions were: Rohan Gurbani (boys U-15), Taarini Suri (girls U-9), Tasnim Mir (girls U-11).\nThe tournament was organised by Sara Foundation and PNB MetLife India, under the auspices of Maharashtra Badminton Association. According to organizers, all quarter-finalists in each category qualified for the inter-zonal Grand Finale, to be held in New Delhi later this month.\nResults\nFinals:\nGirls U-9:         Taarini Suri (Mumbai) bt Ananya Naidu (Thane) 21-4, 21-4. U-11: Tasnim Mir (Mehsana) bt Tara Shah (Pune) 21-15, 21-9. U-13: Aarya Deshpande (Satara) bt Tasnim Mir (Mehsana) 21-17, 21-10. U-15: Smit Toshniwal (Nashik) bt Simran Singhi (Mumbai) 21-15, 18-21, 21-15.\nBoys U-9 :         Parth Deore (Nashik) bt Vansh V Rohit (Bharuch) 21-19, 20-22, 21-12; U-11: Nitin Shinde (Islampur) bt Prajjwal Sonawane (Nashik) 21-12, 15-21, 21-8. U-13: Tanishq Saxena (Mumbai) bt Ameya Khond (Nashik) 21-15, 21-9. U-15: Rohan Gurbani (Nagpur) bt Aniruddh Sinh Kushwaha (Valsad) 21-13, 21-15.\nSemi-finals\nGirls - U-9:         Taarini Suri (Mumbai) bt Rashi Hegde (Mumbai) 21-7, 21-5; Ananya Naidu (Thane) bt Sarah Susan George (Mumbai) 21-8, 21-9.\nU-11:         Tasnim Mir (Mehsana) bt Aalisha Naik (Mumbai) 21-11, 21-9; Tara Shah (Pune) bt Vedika Diwan (Nashik) 21-13, 21-11.\nU-13:         Aarya Deshpande (Satara) bt Rudra Shyam Rane (Mumbai) 21-17, 21-17; Tasnim Mir (Mehsana) bt Hrissha Dubey (Mumbai) 21-13, 21-10.\nU-15:         Simran Singhi (Mumbai) bt Nupur Anand Vasavada (Vadodara) 21-10, 21-10 ; Smit Toshniwal (Nashik) bt Janhvi Khanna (Vadodara) 21-12, 16-21, 21-15.\nBoys - U-9:         Parth Deore (Nashik) bt Ojas Ranjit Gedam (Akola) 14-21, 21-19, 21-15; Vansh V Rohit (Bharuch) bt Rohan Barve (Mumbai) 21-8, 21-16.\nU-11:         Nitin Shinde (Islampur) bt Harsh Girish Pawar (Mumbai) 21-11, 21-14; Prajjwal Sonawane (Nashik) bt Siddhartha Das (Navi Mumbai) 22-20, 21-8.\nU-13:         Tanishq Saxena (Mumbai) bt Aryan Hosangady (Mumbai) 21-8, 21-9; Ameya Khond (Nashik) bt Dhruv Oza (Mumbai) 21-18, 21-9.\nU-15:         Aniruddh Sinh Kushwaha (Valsad) bt Pranava Jain (Mumbai) 17-21, 21-13, 21-17; Rohan Gurbani (Nagpur) bt Rahul Kane (Kolhapur) 22-20, 21-12.\nPublished - March 07, 2015 07:31 pm IST\nbadminton",
    "published_date": "7 Mar 2015",
    "year": 2015,
    "month": "March",
    "url": "https://www.thehindu.com/sport/other-sports/junior-badminton-championships-smit-stuns-simran-for-title/article10713403.ece"
}