{
    "headline": "LIC eases claim settlement norms for Tamil Nadu customers",
    "content": "Country’s largest insurer LIC has extended concessions and relaxations to policyholders affected by the floods in Tamil Nadu and Puducherry.\nLIC has eased the procedure for settlement of claims on the lives of flood victims who are policyholders, the insurer said in a statement.\n“These concessions and relaxations are in the nature of simplified procedure for death and disability claim settlement, loss of policy document claim settlement on the lives of ‘missing’ persons etc, similar to the concessions extended to the victims of floods and landslides in Uttarakhand in June 2013, flood disaster in J&K in September 2014, Cyclone in Andhra Pradesh and Odisha in October 2014 and Nepal disaster in April 2015,” it said.\nThe recent floods in Tamil Nadu and Puducherry have caused injury and loss of lives on a big scale.\nIn a separate statement, PNB MetLife said it has set up a dedicated claims helpline for the Tamil Nadu flood victims with Toll free number                         18004256969         in an effort to provide relief and assistance to the victims.\nPNB MetLife has streamlined the claim process for the aid of flood-affected customers where easy alternatives to the standard documents can be submitted.\nPublished - December 07, 2015 08:19 pm IST\nChennai rains 2015\n                    \n                            /                      \n                        \n                        flood\n                    \n                            /                      \n                        \n                        economy, business and finance\n                    \n                            /                      \n                        \n                        natural disasters",
    "published_date": "7 Dec 2015",
    "year": 2015,
    "month": "December",
    "url": "https://www.thehindu.com/business/lic-eases-claim-settlement-norms-for-tamil-nadu-customers/article7958517.ece"
}