{
    "headline": "‘Saina Squad’ makes its presence felt",
    "content": "They could become the Indian equivalent of the Barmy Army, the British band of cricket enthusiasts who follow the fortunes of their team, crossing seas.\nA motley crew of 18 die-hard fans, drawn from a string of contests on social media conducted by STAR Sports shadowed Saina Nehwal in the MetLife BWF World superseries. Outfitted with dark blue personalised jerseys, travel T-shirts with names, caps, badges and friendship bands, the ‘Saina Squad’ was visibly and vocally supportive of the Indian ace.\nOut of the rooting Carolina Marin got during the BWF finals from a set of Spanish fans, all the more pronounced in the finals when Indonesian fans supported the world No. 1, was born the STAR Sports concept of a dedicated band of followers for Saina. Saina was excited for this was something she had never done before, said a STAR Sports marketing team member. A meet and greet programme was held on the eve of the championship, where the ‘Saina Squad’, flown in from India, met its favourite sportsperson.\nThe world No. 2’s first round defeat to Nozomi Okuhara was more than made up for by a fighting win over world champion Carolina Marin. “We’ll continue to back you,” the squad had told Saina after that first setback against the Japanese shuttler.\nThe ‘Saina Squad’ was a mix of fans from across the country, ranging in age from 18 to 43 years. On Thursday night after the Indian ace’s victory over Marin, the squad was understandably elated. Before she left the stadium, Saina spent time with her fans, who shot selfies with her.\nMeanwhile, Viktor Axelsen pulled off the biggest upset of the MetLife BWF World Superseries, toppling two-time world champion Chen Long 21-12, 21-17on Saturday. In the women’s semifinals, Nozomi Okuhara stunned the world champion 21-11, 21-12.\nThe results: (Semifinals): Men:         Viktor Axelson (Den) bt Chen Long (Chi) 21-12, 21-17; Kento Momoto (Jap) bt Jan O Jorgensen (Den) 21-19, 21-18.\nWomen:         Nozomi Okuhara (Jap) bt Carolina Marin (Spa) 21-11, 21-12; Wang Yihan (Chi) bt Ratchanok Intanon (Tha) 21-12, 21-12.\nPublished - December 13, 2015 02:22 am IST\nbadminton",
    "published_date": "13 Dec 2015",
    "year": 2015,
    "month": "December",
    "url": "https://www.thehindu.com/sport/other-sports/saina-squad-makes-its-presence-felt/article7981658.ece"
}