{
    "headline": "PNB MetLife comes to badminton’s aid",
    "content": "The title sponsor of the Indian Badminton Super Series for 2014-2017, PNB MetLife, in partnership with Badminton World Federation (BWF), has given a booster to grassroots-level badminton by announcing a three-year engagement with juniors in the 9-15 age group from this year.\nPNB MetLife has unveiled the junior badminton championship (JBC) that will be initially held in Delhi, Mumbai, Kolkata and Bengaluru in February-March.\nAfter the four-zonal competitions the final will be held in Delhi. The PNB MetLife JBC has the blessings of the Badminton Association of India (BAI) and it will be conducted in association with Sara Foundation.\n“The top eight children will be awarded scholarships for training at reputed badminton academies, scholarships will be given to underprivileged children and 1000 housing societies and 150 corporates will be targeted for the development of badminton,” said PNB MetLife MD & CEO Tarun Chugh at a media conference here on Wednesday.\nNGO Child Rights & You (CRY) will be part of this badminton initiative; it already works with the company and their programmes have touched the lives of 12,000 children in Jammu & Kashmir and Karnataka.\n“The objective is to search for the future champions from among school children. We aim to target 3000 school children. The 16 zonal winners will be taken to Delhi to witness the BWF Super Series from March 24 to 29,” said Chugh.\nPara badminton world No. 1 Anand Kumar said: “Badminton is a popular sport, but the players find it difficult to access sponsors and right training.” The company will assist Anand Kumar to take part in the Spanish para badminton international to be held in March.\nThe JBC will be run with the slogan ‘Hunt for the future badminton star of India’, and it has the support of former All England champion P. Gopichand, H.S. Prannoy, Sameer Verma, Shlok Ramachandran, Siki Reddy, Tanvi Lad, Sayali Gokhale, Neha Pandit, Arundhati Pantawane and Mohita Sehdev.\nThe JBC has already has received 2000 on line entries at         >www.mycity4kids.com         and         >www.playforhappiness.in         .\nPublished - February 05, 2015 06:29 pm IST\nbadminton\n                    \n                            /                      \n                        \n                        sport",
    "published_date": "5 Feb 2015",
    "year": 2015,
    "month": "February",
    "url": "https://www.thehindu.com/sport/other-sports/pnb-metlife-comes-to-badmintons-aid/article6861157.ece"
}