{
    "headline": "Tata Sons plans to sell 3% stake in TCS",
    "content": "Tata Sons plans to sell a three per cent stake in the country’s largest software exporter, Tata Consultancy Services, for Rs.14,700 crore and acquire a 70 per cent stake in PNB Metlife for Rs.2,700 crore.\nIt also plans to sell a 30 per cent stake in its renewable power venture for Rs.3,000 crore. These were decisions approved during the last few board meetings, according to the minutes of the Tata Sons meeting, which was filed as part of Mistry’s petition against Tata Sons.\nTata Sons FY17 business plan projected total income of Rs.8,103 crore and expenses of Rs.2,425 crore, resulting in an estimated profit of Rs.5,677 crore. The business plan included a proposal to sell 3 per cent in cash cow TCS for meeting a part of the fund requirements during the year. Profit of Rs.14,700 crore was estimated on the sale, according to the minutes of Tata Sons’ September board meeting. The board was however informed that the proposed sale of TCS stake was work in progress and could be spread over two years.\nAt the October 24 board meeting it was decided that Tata AIA Life Insurance Company Limited would be putting a non-binding bid to acquire a 70 per cent stake in PNB Metlife for Rs.2,700 crore. Met holds 26 per cent stake in PNB Metlife, 21 per cent stake is being held by Elpro, 18 per cent by M Paloonji & Company and 5 per cent by Jammu & Kashmir Bank Limited and the rest by Punjab National Bank.\nMr. Ishaat Hussain proposed a deal structure under which Tata along with AIA would buy out the existing stake of all stake holders in PNB Metife, aggregating to 70 per cent, other than that of Punjab National Bank, followed by a merger of the two insurers.\nThe initial outgo from Tata Sons would be in the range of Rs.1,500 crore to Rs.2,700 crore with Tata Sons holdings in Tata AIA Life Insurance Company expected to be diluted from 51 per cent to 45 per cent post the deal.\nVodafone proposal\nIn the June board meeting of Tata Sons, Nitin Nohria reported on his discussions with the CEO of Vodafone, who continued to be interested in acquiring Tata Teleservives Limited (TTSL).\nDr. Nohria mentioned that the start of Reliance Jio was expected to impact the existing telecom players including Vodafone. He explained that Vodafone would be serious about consolidation in order to make up for the losses of customers to Jio.\nRenewable power\nIn a presentation on Tata Power before a board meeting in June, when Tata bought the assets of Welspun Renewables Energy for Rs. 10,000 crore, Anil Sardana, MD & CEO Tata Power informed the board that the acquisition was proposed to be initially funded by borrowing of Rs.3,500 crore for investment into Tata Power Renewable Energy and another Rs.500 crore at the holding company level.\n“Within a year, a 30 per cent dilution TPREL was envisaged by the TPC management to raise Rs.3,000 to Rs.3,600 crore to repay a significant portion of the acquisition debt,” Mr. Sardana said, citing investors who had spoken of a 8-9 per cent multiple on renewable investments compared with 6 per cent for Tata Power.\nPublished - December 21, 2016 10:35 pm IST\ncompany information",
    "published_date": "21 Dec 2016",
    "year": 2016,
    "month": "December",
    "url": "https://www.thehindu.com/business/Industry/Tata-Sons-plans-to-sell-3-stake-in-TCS/article16919474.ece"
}