{
    "headline": "Tata AIA to buy 70 per cent stake in PNB Metlife",
    "content": "According to the minutes of a board meeting, Tata Sons along with it’s partner AIA Group will place a non-binding bid to acquire a 70 per cent stake in PNB Metlife up to the tune Rs 2,700 crore and then merge it with Tata AIA Life Insurance Company.\nThis decision was made during the board meeting held on October 24, the details of which have been filed as part of Cyrus Mistry’s petition against the Trust in the National Company Law Tribunal (NCLT).\nIn PNB Metlife,\nMetLife International Holdings LLC holds 26 per cent stake,\nElpro International holds 21 per cent\nM Paloonji & Company holds18 per cent stake\nJammu & Kashmir Bank Limited holds 5 per cent stake held by and\nThe remaining 30 per cent stake is held by Punjab National Bank.\nM Pallonji and Company is owned by Ratan Tata’s friend and Mr. Mistry’s relative Mehli Mistry.\nMr. Ishaat Hussain, a Tata Sons board member and also chairman of Tata AIA Life Insurance Company in the board meeting after Mr. Mistry’s ouster proposed a deal structure under which Tata, along with AIA, will buyout the existing stake of all stake holders in PNB Metife, aggregating to 70%, other than Punjab National Bank Limited, followed by a merger of the two insurance entities.\nAs per the deal structure, PNB will sell its stake in the merged entity through a ‘put’ option within three years or Tata Sons and AIA can exercise a ‘call’ option in four to five years post merger.\nThe initial outgo from Tata Sons would be in range of Rs. 1,500 crore to Rs. 2,700 crore with Tata Sons holdings in Tata AIA Life Insurance Company is expected to dilute from 51 per cent to 45 per cent post this deal.\nTata AIA Life Insurance Company Limited (Tata AIA Life) is a joint venture company, formed by Tata Sons Ltd. and AIA Group Ltd. (AIA). Tata Sons holds a majority stake (51 per cent) in the company and AIA holds 49 per cent through AIA International Limited. The company started operations in April 2001 aims to secure the lives of 3 Million consumers by 2020.\nPNB MetLife has also been present in India since 2001 over 150 locations across the country and serves customers in more than 7,000 locations through its bank partnerships with PNB, JKB and Karnataka Bank Limited.\nWhen asked to comment, a Tata AIA spokesperson in an email reply said, “As a company policy, we do not comment on market rumours.” A mail sent to PNB Metlife spokesperson seeking comments failed to illicit any response.\nEarly this year, Max Financial Services and Max Life announced it plans to merge with HDFC Life, while L&T General plans to merge into HDFC ERGO General Insurance.\nPublished - December 22, 2016 02:14 pm IST\neconomy, business and finance\n                    \n                            /                      \n                        \n                        merger, acquisition and takeover",
    "published_date": "22 Dec 2016",
    "year": 2016,
    "month": "December",
    "url": "https://www.thehindu.com/business/Industry/Tata-AIA-to-buy-70-per-cent-stake-in-PNB-Metlife/article16924109.ece"
}