{
    "headline": "Forum directs MetLife to offset Rs. 16.72 lakh loan",
    "content": "Terming the insurance company’s rejection of a claim as ‘unjust and improper’, the District Consumer Disputes Redressal Forum-III, Hyderabad, directed MetLife India Insurance Company Limited to offset the outstanding amount on a loan of Rs.16.72 lakh taken by a consumer.\nThe consumer forum also ruled that rejecting the claim amounted to deficiency of service, and asked the company to pay a compensation of Rs. 50,000.\nThe order passed on June 9 was the result of a petition filed by Surekha Nallwar, a resident of Khairatabad, who approached the Forum after MetLife Insurance Company Limited rejected an insurance claim for a policy taken by her son N. Praveen Kumar, for which she was the only nominee.\nThe single premium policy was taken on October 31, 2008, for a sum of Rs. 22,025.\nThe said policy was taken to offset any outstanding payments on a housing loan amount of Rs. 16,72,025 taken by Mr. Kumar, and it covered his property and life.\nThe last EMI of Rs. 9,494 was paid by Mr. Kumar on January 7, 2009, on the loan. The next day, Mr. Kumar collapsed due to a seizure, after which he was rushed to Global Hospital at Lakdikapul.\nAfter check-up and tests were done on Mr. Kumar, he was asked to come for a review to the hospital on January 22. However, he died on January 20 itself due to a ‘cardio respiratory arrest’.\nAfter that, his mother, the complainant, approached the insurance company to claim the amount required for the loan on grounds of accidental death.\nHowever, Ms. Nallwar’s request was rejected by the company, which stated that her son had died on the 82{+n}{+d}day after he took the policy, before completion of the 90-day waiting period.\nIn response to her complaint, MetLife Insurance Company Limited said that since Mr. Kumar’s death was caused due to a ‘cardio respiratory arrest’ and was not an accident.\nIt pointed out that the policy stated that during the waiting period, benefits will not be paid ‘on death to causes other than accident’.\nAfter going through all the evidence at hand, the Forum however ruled that the company was at fault and liable to pay Ms. Nallwar the remaining amount of the housing loan, along with a compensation of Rs.50,000.\nThe ruling bench noted that “even on compassionate grounds the insurer ought to have not taken a technical objection for a mere 8 days short of the stipulated 90 days.”\nPublished - June 19, 2016 12:00 am IST",
    "published_date": "19 Jun 2016",
    "year": 2016,
    "month": "June",
    "url": "https://www.thehindu.com/news/cities/Hyderabad/Forum-directs-MetLife-to-offset-Rs.-16.72-lakh-loan/article14431195.ece"
}