{
    "headline": "Messi targets Copa Centenario cup",
    "content": "Lionel Messi and Argentina will be targeting the country’s 23-year title drought when the Copa America Centenario kicks off on Friday after a troubled build-up marred by corruption allegations which threatened to derail the event.\nOne hundred years after Uruguay clinched the inaugural four-team South American championship in Argentina, 16 teams from across the Americas are gathered in the United States for a special one-off edition of the tournament.\nThe three-week festival of football gets under way at the Levi's Stadium in California on Friday, when the United States face Colombia at the home of the San Francisco 49ers American football team.\nThe tournament will conclude with a final at New Jersey's MetLife Stadium in East Rutherford on June 26, drawing a line under what is arguably the biggest tournament held in the United States since the 1994 World Cup.\nBilled as a celebration of football across the Americas, 10 South American teams and six teams from the CONCACAF (North America, Central America and the Caribbean) region make up the field.\nFor organizers, the mere fact that the tournament is taking place at all is something of a triumph.\nFor several months last year the Copa faced an uncertain future after the arrest and indictment for corruption of several officials from South America and CONCACAF responsible for dreaming up the tournament.\n'World Cup of Fraud':         When plans for the tournament were launched at a glitzy event in Miami in 2014, CONCACAF President Jeffrey Webb stood proudly alongside South American federation (CONMEBOL) chief Eugenio Figueredo.\n“The American continent may have been discovered in 1492, but I can't imagine a better way to unite this continent than with football,” Webb said.\nYet if prosecutors have their way, both men may soon be united behind bars.\nWebb and Figueredo were among several officials arrested in Switzerland in May 2015 as part of the US-led corruption investigation which ultimately led to the sensational downfall of FIFA President Sepp Blatter.\nWith impeccable timing, Webb is due to appear in a New York courtroom on Friday — the day of the opening match — to face sentencing for his role in the scandal.\nFigueredo, 84, was extradited to Uruguay from Switzerland last December and also faces criminal prosecution.\nBoth Figueredo and Webb — as well as former CONMEBOL chief Nicolas Leoz — are accused of pocketing millions of dollars in bribes linked to the award of media rights for the tournament, part of a scam dubbed a \"World Cup of Fraud\".\n'We deserve championship'        : The sleazy background to the competition threatened to take the shine off an event which will bring together some of the world's best players.\nMessi and Argentina will be aiming to win the country's first major title since the 1993 Copa America after a series of recent near-misses.\nThe Argentines lost both the 2014 World Cup final and the 2015 Copa America in Chile. Messi, due in Spain this week to attend his trial for tax fraud, says it is time Argentina's talented players delivered.\n“It has been a very long time since Argentina has won anything, and this group came very close in the World Cup and at the last Copa America,” he told Sports Illustrated on the eve of the tournament.\n“I think we deserve to be champions of an important competition.”\nArgentina opens their campaign against Chile in Santa Clara next Monday. Panama and Bolivia complete Group D.\nThe United States meanwhile will aim to build on their encouraging performance at the 2014 World Cup, when they reached the knockout round, by progressing from a \"Group of Death\" which includes Colombia, Costa Rica and Paraguay.\nFive-time World Cup winners Brazil will be favoured to safely navigate Group B, where they face Ecuador, Haiti and Peru.\nThe Brazilians open against Ecuador at Pasadena's Rose Bowl on Saturday — scene of their victory at the 1994 World Cup final.\nMexico and Uruguay will be expected to progress from Group C, with Jamaica and Venezuela completing the field.                         © AFP, 2016\nPublished - June 01, 2016 01:45 pm IST\nsoccer",
    "published_date": "1 Jun 2016",
    "year": 2016,
    "month": "June",
    "url": "https://www.thehindu.com/sport/football/Messi-targets-Copa-Centenario-cup/article60508593.ece"
}