{
    "headline": "Spain joins forces with Bollywood to boost tourism",
    "content": "Spain is coaxing Indian moviemakers to use its colourful fiestas and historic monuments as settings for their films, in a move to grab a bigger share of India's fast-growing overseas tourism market.\nAs part of its bid to lure visitors from India Madrid will host next weekend the annual International Indian Film Academy awards (IIFA), dubbed the \"Bollywood Oscars\".\nIn global tourism, Spain ranks as the third most visited country, but it now wants to diversify its tourism base beyond the traditional northern European sunseekers that account for the bulk of its visitors.\nAmong the Bollywood stars who will attend the awards ceremony in Spain will be actor Hrithik Roshan, the star of the 2011 coming-of-age movie                         Zindagi Na Milegi Dobara        , which was produced in close collaboration with the Spanish tourism promotion agency, Turespana.\nThe film about three friends on a pre-marriage road trip across Spain includes scenes at the ‘La Tomatina’ festival in the town of Bunol as well as at Pamplona's San Fermin bull running festival.\nWith scenes also set in Barcelona, Seville and the beaches of the Costa Brava, the movie was the first major Indian production to shoot extensively in various locations in Spain.\nIt was also the highest grossing Bollywood film of 2011.\n\"There was an immediate impact in the number of people requesting entry visas to travel to Spain,\" the director of the London office of Turespana, Enrique Ruiz de Lera, who led the agency's talks with the producers of the movie, told AFP.\nThe year after its release, 60,444 Indians visited Spain, nearly double the 2011 figure, according to the industry and tourism ministry. Last year 85,000 Indians visited Spain.\nLonely Planet in 2013 launched a guide to Spain aimed specifically at the Indian market and travel agencies still advertise tours to the locations featured in                         Zindagi..        .\nIndia's ambassador to Spain, Vikram Misri, said the film \"was singlehandedly responsible for making Spain a household name in India and increasing tourism from India\".\nCruise ship movie\nTurespana suggested locations for filming but gave no direct financial aid to cover the cost of making the movie, Ruiz de Lera said.\nInstead it helped secure permits to film at key sites and negotiate deals on hotel rooms and transportation for the crew to lower production costs. \"We helped a lot with contacts so filming in Spain was easy,\" Ruiz de Lera said.\nIn return, the producers of the film agreed to include a short advertisement before the start of the movie promoting Spain by award-winning Spanish director Julio Medem.\nSpain and India signed a film co-production agreement the year after                         Zindagi…         was released.\nTurespana regularly takes part in film location fairs in India to pitch the tax breaks and other incentives available to movie producers who shoot in Spain.\nSince                         Zindagi...        , another \"five or six\" Indian films have been shot in Spain although none was as popular at the box office, the director of the Mumbai office of Turespana, Ignacio Ducasse, told AFP.\nThey include one by                         Zindagi…         director Zoya Akhtar —                         Dil Dhadakne Do         featuring actor Anil Kapoor — which was filmed on a ship belonging to Pullmantur, Spain's biggest cruise operator.\nThe comedy-drama about a dysfunctional family on a 10-day Mediterranean cruise was released last year and it includes scenes shot in Barcelona as well as in the various bars, restaurants and open decks of the ship.\nStars in ad campaign\nKapoor, 59, best known internationally for his role in the 2008 film                         Slumdog Millionaire        , said during a visit to Madrid in March to promote IIFA that he is \"looking forward to coming back again and again to Spain\".\nTourism is crucial for the Spanish economy, accounting for around 11 percent of gross domestic product and one in nine jobs, according to the tourism ministry. The United Nations World Tourism Organisation predicts India will account for 50 million outbound tourists by 2020, up from just 18 million in 2014.\nTurespana plans to create an ad campaign to appeal to this rising tide of tourists using images of Bollywood celebrities enjoying themselves in Madrid at the awards show. The ceremony itself is expected to bring 15,000 visitors to the Spanish capital during the week of the show.\n\"We are counting that the arrival of several thousand Indian friends for the (awards) ceremony will help bring millions of their compatriots in the coming years,\" Spain's secretary of state for foreign affairs, Ignacio Ybanez, said earlier this year.\nPublished - June 19, 2016 12:31 pm IST\nSpain\n                    \n                            /                      \n                        \n                        cinema\n                    \n                            /                      \n                        \n                        The Hindu Cinema Plus",
    "published_date": "19 Jun 2016",
    "year": 2016,
    "month": "June",
    "url": "https://www.thehindu.com/features/cinema/Spain-joins-forces-with-Bollywood-to-boost-tourism/article14431841.ece"
}