{
    "headline": "Chile stun Argentina to lift Copa America title",
    "content": "Holders Chile stunned Argentina to win the Copa America Centenario in a penalty shootout on Sunday as Lionel Messi's title curse struck again.\nMessi blazed a penalty over the bar in the shoot-out before Lucas Biglia missed to leave Chile's Francisco Silva with the task of stroking home the winning spot-kick at the MetLife Stadium.\nIt was a carbon copy of last year's Copa America final, also won by Chile on penalties after a goalless draw.\nArgentina's players meanwhile were left disconsolate as they digested a third defeat in a major final following losses to Germany in the 2014 World Cup and Chile in last year's Copa.\nThe defeat also ensured Argentina's 23-year wait for a major title — and a first for five-time world player of the year Messi — continued.\nThe final had gone to penalties after finishing deadlocked at 0-0 after 120 minutes.\nBoth sides were reduced to 10 men in the first half as Brazilian referee Heber Lopes struggled to get a grip on an ill-tempered contest played in front of a crowd of 82,026.\nThe first yellow card of the match came in the 16th minute when Marcelo Diaz brought down Messi with a cynical hack across the thighs as the Barcelona star advanced on the Chilean goal.\nArgentina should have taken the lead on 21 minutes when a defensive blunder from Gary Medel, miscontrolling a back pass, allowed Gonzalo Higuain to go clean through on goal.\nChile let-off\nHiguain had time and space but opted to lift his shot over the advancing Bravo and it rolled wide of the post in a huge let-off for Chile.\nIt was a nightmarish case of deja vu for Higuain, who missed potentially match winning chances in both the 2014 World Cup final and last year's Copa America.\nSeven minutes later Chile were left rocking when Messi burst forward only to be bodychecked blatantly by Diaz.\nFor a moment it appeared that referee Lopes had forgotten Diaz's earlier caution but eventually he brandished a red card and Chile were down to 10.\nIt ought to have been a warning to both sides but the spiteful tone continued for the remainder of the half, with Javier Mascherano and Arturo Vidal next into the book in the 37th minute.\nThe next flare-up came on 40 minutes when Messi darted into the box at high speed and tumbled over following a collision with Jose Pedro Fuenzalida.\nChile's players surrounded Lopes demanding a yellow card for a dive and Messi was duly booked even though it looked for all the world as if he had simply gone down after being caught off balance.\nTwo minutes from half-time and Lopes was reaching for a red card, this time sending off Manchester United's Marcos Rojo for a rough tackle on Vidal.\nThe cards continued in a fractious start to the second half, Jean Beausejour booked for hacking at Gabriel Mercado.\nA cynical foul on Messi by Charles Aranguiz resulted in another yellow card.\nThe introduction of Sergio Aguero for Higuain had little effect with Argentina failing to break the stalemate.\nChile striker Eduardo Vargas went close on the 80th minute, thumping a fierce low shot that Romero did well to block at his near post.\nAguero had a chance to steal victory in the 84th minute when he was worked into space on the right of the box but he blazed his shot high and wide.\nThere was still time for late drama when Ramiro Funes-Mori made a stunning match-saving block to deny Alexis Sanchez.\nFrom the Argentinian counter-attack, Messi surged forward from halfway to shoot wide.\nAmid suffocating tension in extra-time, Chile had the best early chance to score in the 98th minute when he headed Edson Puch's cross only to be denied by Romero.\nAguero then drew a fine save from Bravo with a looping header.\nAfter that there was little in the way of chances, leaving the game to hinge on the penalty shootout.\nPublished - June 27, 2016 09:07 am IST\nsoccer",
    "published_date": "27 Jun 2016",
    "year": 2016,
    "month": "June",
    "url": "https://www.thehindu.com/sport/football/Chile-stun-Argentina-to-lift-Copa-America-title/article60562664.ece"
}