{
    "headline": "IIFA awards: A green carpet welcome",
    "content": "Temperatures soared slightly higher than usual at Madrid last night as the green carpet was taken over by sizzling hot celebrities who walked down the carpet for the technical awards.\nHosted by notable directors and actors Karan Johar, Fawad Khan and Manish Paul....they made it an evening to remember with their jokes, humour, repartee and great compering. The audience went into a frenzy as they watched their favourite stars dance and sing their favourite numbers all through the night.\nWalking down the carpet the celebrities spoke to the Indian media on a range of topics. Shahid Kapoor was all smiles as he spoke about                         Udta Punjab         becoming his biggest opener ...he said, \"I was happy when the movie made it to the theatres. But the appreciation it has garnered is extraordinary.\"\nFrieda Pinto shared her experience about being a regular visitor to Spain but more excited this time around as she makes her debut appearance at the IIFA this year. Newly weds Bipasha Basu and Karan Singh Grover told us how they were actually having fun and it's almost like an extended honeymoon. Karan Johar, Fawad Khan, Farhan Akhtar said they were all eagerly waiting to have fun on and off stage. Veterans like Anupam Kher, Anil Kapoor, Sanjay Leela Bhansali, Gulshan Grover, Rakesh Om Prakash Mehra applauded the IIFA for showcasing Bollywood in such an exceptional manner.\nShowstoppers Dia Mirza, Nargis Fakri, Bipasha Basu, Lara Dutta, Deepika Padukone, Sonakshe Sinha admitted that they loved coming to Spain and were waiting for the power packed performances and enjoy themselves in Spain. They shared their experiences about eating great food, listening to some great live music and chilling with friends.\nWhile Manish Paul kept the crowd entertained be it his quiz time with Sonakshi Simha and mother Poonamalle Sinha or as he quizzed the trio Ritiesh Deshmukh, Vivek Oberoi, Aftab Shivadasani using a lie detector ahead of their movie release The Great Grand Masti. Shilpa Shetty got all heads turning every time she did her signature Thumka. The crowd went into a dizzy as she performed to her famous chartbusters. Sooraj Pancholi's power packed performance has the audience scream out his name aloud as they asked him to come back on stage. Singing sensations Kanika Kapoor, Neeti Mohan, Papon, Meet brothers and Benny Dayal paid their tribute to the 70's as the crooned to chartbusters from that The amazing Raghu Dixit enthralled the audience with his fabulous performance at the IIFA Stomp ISLA stage through the night.\nIt was a night to remember for the actor and crew of the movie                                     Bajirao Mastani               as it stole the show and wiped the slate clean winning the maximum awards in the technical categories. They won a total of nine Awards out of the 14. They won for the Best Background Score, Best sound Design and also won the Best Costume Design: Anu Modi for                                     Bajirao Mastani              , Best Visual Effects:                                     Bajirao Mastani              , Best Action: Sham Kaushal for                                     Bajirao Mastani              .\nPublished - June 25, 2016 02:56 pm IST\nentertainment (general)\n                    \n                            /                      \n                        \n                        The Hindu Cinema Plus",
    "published_date": "25 Jun 2016",
    "year": 2016,
    "month": "June",
    "url": "https://www.thehindu.com/entertainment/IIFA-awards-A-green-carpet-welcome/article14401264.ece"
}