{
    "headline": "PNB MetLife launches VR-based customer service platform",
    "content": "Private life insurance firm PNB MetLife on Monday launched a virtual reality-based customer service platform.\nCustomers need to visit select PNB MetLife branches and wear the VR headset to get their service requirements addressed. Assisting them in this process would be an insurance expert based out of another location. The platform would display policy related information and engage customers through visual assist elements like animation, the company said.\nIt is the first-of-its-kind in the insurance sector, Insurance Regulatory and Development Authority of India (IRDAI) member (life) Nilesh Sathe said at an event in the city after IRDAI Chairman T.S. Vijayan launched the facility.\nThe conVRse platform would initially be available in 15 branches across 10 cities — Delhi, Mumbai, Hyderabad, Bengaluru, Kolkata, Jammu, Chandigarh, Lucknow, Ahmedabad, and Pune. Noting that the company has been experimenting with the VR facility in Delhi for six months now, PNB MetLife managing director and CEO Tarun Chugh said the company would be extending the facility to all the 130 branches in phases and then eventually to customers homes.\nCounting the advantages, Mr. Chugh said it would help customers be better informed about their policy and reduce misselling. He expected the facility to become popular as the price of the headsets is on the decline. From Rs. 33,000 a few years ago, the cost hovers around Rs. 7,500 a device, and was expected to come down further.\nMr. Vijayan said IRDAI was keen on customers getting the best service, irrespective of whether they were in rural or urban areas. The developments in technology, he said, should make it happen.\nInsurance sector has been a bit slow in adopting technology, Mr. Sathe said. “Going forward, traditional insurance companies will find it difficult if they do not adopt technology.”\nLater, to a query he replied that the growth in new business premium till November was 38 per cent and was expected to be 20 to 25 per cent by the end of the fiscal.\nPublished - December 20, 2016 12:21 am IST\ninsurance\n                    \n                            /                      \n                        \n                        business (general)\n                    \n                            /                      \n                        \n                        Hyderabad\n                    \n                            /                      \n                        \n                        Telangana",
    "published_date": "20 Dec 2016",
    "year": 2016,
    "month": "December",
    "url": "https://www.thehindu.com/news/cities/Hyderabad/PNB-MetLife-launches-VR-based-customer-service-platform/article16907362.ece"
}