{
    "headline": "Deepika spills beans on Hollywood project, IIFA performance",
    "content": "It's a big night for Deepika Padukone at the IIFA awards function on Saturday. She's nervous as not only is this her first performance for the season, but what adds to the stress is that she will be dancing to her songs from                         Bajirao Mastani         and seated among the audience will be her director Sanjay Leela Bhansali who is flying in all the way from India to see this.\nDeepika has been making news for her projects in the west. Fans and media are curious to know why she would not be giving us any Bollywood release this year and why will it be only a Hollywood flick                         xXx: The Return of Xander Cage        .\n\"For me I do not treat a film as coming from Hollywood or Bollywood. It's the script I read first. I need to know if I will love doing it and it’s only after that I take up roles. I will take up roles when they excite me or when I am ready. This experience is special for me and I am very excited about it.\"\nI prod further and ask her how different or similar are two industries and she is quick to answer. \"Wow I was waiting for someone to ask me this. If I have to say I did not miss anything at all and the only thing that was different was the location then you will realise as a film industry where we stand. The journey of Indian cinema has been amazing. The growth be it technically, content, or in the films we are on par with Hollywood. It was so comforting to know I did not miss anything.\"\nPersonally however, there were many firsts shooting in the west. Staying by herself in an apartment, cooking meals and doing her laundry, Deepika loved each part of this. From taking her candles and photo frames to cooking meals be it                         rasam         or                         sambar         she enjoyed it all. \"There were many Indian restaurants in Toronto so finding North Indian food was not a problem so I cooked my sambar and rasam. I would ask people coming to visit me to bring me pre mixes and masala packets,\" she adds.\nComing back to IIFA she admits that though it's her first time in Madrid she loves Spain.\n\" I am loving it. Music, love, warmth, food, generosity...There so many similarities between the two countries and it's a good way to showcase what we are doing with our movies,\" she adds.\nPublished - June 24, 2016 12:57 pm IST\ncelebrity\n                    \n                            /                      \n                        \n                        cinema\n                    \n                            /                      \n                        \n                        The Hindu Cinema Plus",
    "published_date": "24 Jun 2016",
    "year": 2016,
    "month": "June",
    "url": "https://www.thehindu.com/entertainment/Deepika-spills-beans-on-Hollywood-project-IIFA-performance/article14399230.ece"
}