{
    "headline": "‘ULIPs may attract more investors in 2018’",
    "content": "Bajaj Allianz Life Insurance has recorded 89% growth in new business premium in its unit linked insurance plans (ULIPs), riding on the boom in the equity markets. ULIPs would be an attractive investment option for retail investors in 2018, says                           Tarun Chugh          , the firm’s CEO and MD, in an interview. Edited excerpts:\nWhat is the outlook for insurance industry in FY18?\nThe major trend in the banking, financial services and insurance (BFSI) space is the uptake in the equity markets, especially from retail investors. We have seen 89% growth in new business premium of our Unit Linked Insurance Plans (ULIPs) from April to September 2017. We also expect this trend to continue in the new year as equity markets are looking up. [We are] planning to launch more ULIP products in the months to come.\nWhat are the three top trends in digitisation of insurance that you have seen in the last three years?\nInsurers have realised the value of digitisation in insurance.\nIt leads to enhancement of customer experience, creates new business opportunities, helps in reducing costs, allows operational flexibility and drives engagement with customers on a real-time basis. The top three trends, addressing these business opportunities, would be: end-to-end paperless processes from presales to underwriting to post-sales services; growth in online sales; providing services which are quick, non-intrusive and available 24x7\nRapidly changing consumer behaviour is reshaping the insurance industry. How will digitisation impact customers?\nConsumer behaviour has been reshaped with the advent of digital and e-commerce companies in the last two decades. This gamut of digitisation, brought in by these companies, is continuously evolving. Its impact can be seen in the way consumers, both new and traditional, are engaging with businesses. Consumers today have greater access to real time information. Hence, it is vital that organisations acknowledge this shift in consumer behaviour.\nThis change is challenging insurers, who are not digitally native, to focus on products, business models and service delivery models which are end-to-end digital. This will result in better offerings in the form of improvised offerings, reduced TATs (turn around time) and personalised experiences.\nWe are continuously investing in improving our offerings on the digital platforms, both through our own website and via web aggregators. Contribution of online sales to our entire portfolio has been increasing rapidly.\nWe are also embracing digitisation to stay in tune with the expectations of the end consumer and making our processes paperless. A customer today can have his proposal form digitally filled on a tab, complete his E-KYC via Aadhaar verification and have his policy document delivered electronically via mail and stored in IRDAI authorised e-repositories such as CAMS, KARVY and NSDL.\nHow has the agent-company relationship evolved?\nAt Bajaj Allianz Life Insurance, agency continues to be the key distribution channel with nearly 86% of the retail-rated new business premium being routed through this channel. Nearly 77% of the company’s total customers are mass and sub-mass segments. Their ability to buy high premium products, multiple policies and risk-taking capacity was limited. Thus, this year, we focused on improving our product mix to cater to affluent and mass affluent segments.\nIn September, we introduced I-smart, a comprehensive portal for our agents. I-smart is available on mobile and tablet devices, and has already seen 12,500 downloads with 5,000 agents using it on a daily basis and 500 fresh downloads every day.\nToday, mobile should be considered as the consumer’s remote control to start engagement with brand. From real-time executions to native campaigns, location-based targeting and advertising, mobile’s power is that it’s personal; all-pervasive – it’s with the consumers all day, from first thing in the morning till the last thing at night; and useful – it is consumed on the go. In other words, Mobile-based touchpoints will be the face for not only the life insurance sector, but also across BFSI space as mobile-based touchpoints can reduce complexities in underwriting, distribution and product servicing, and increase customer engagement on real time basis.\nHow do you ensure data security?\nBajaj Allianz Life Insurance has implemented Data loss prevention (DLP) solution which protects sensitive information going outside company network via Mail, USB or Network. We have [also] implemented Mobile Device Management (MDM) for all mobile devices accessing company mails. This prevents users from downloading any attachment to mobile devices. All company-related information can be wiped out in case a device is lost.\nIn tier 2 / 3 markets, we have extensively used analytics to understand the customer needs better and thereafter provide the right product. We have worked on our product portfolio and have the right mix of product offerings across both Traditional and ULIP categories that suit customer needs. We are one of the largest players in the Tier 2 / 3 markets and are looking at further enhancing our presence by recruiting an additional 10,000 agents by the end of this fiscal. We have also intensified our insurance awareness drives by conducting roadshows and                         nukkad nataks         which educate consumers about the importance of being insured and to existing customers with policy renewal at their doorstep.\nWhy are so many insurance companies going in for IPOs?\nIRDA’s (Insurance and Regulatory Development Authority) move to relax capital raising norms whereby it allowed insurance companies [in existence for] over 10 years to go public, has led to a slew of IPOs.\nListing on the stock market has been principally taken by companies to raise capital for expansion of operations, increase liquidity for shareholders, enhance brand image and create valuable currency stocks that can be used to make acquisitions and compensate employees.\nIt is likely these IPOs will bring about better awareness regarding insurance services among the investing public. That may translate into an increase in insurance penetration (percentage of insurance premia to GDP), better products and enhanced service standards.\nDoes Bajaj Allianz Life also have plans for an IPO?\nNo, we are not looking at an IPO [any time] soon.\nPublished - December 24, 2017 10:05 pm IST\neconomy, business and finance",
    "published_date": "24 Dec 2017",
    "year": 2017,
    "month": "December",
    "url": "https://www.thehindu.com/business/ulips-may-attract-more-investors-in-2018/article22271475.ece"
}