{
    "headline": "All set for IIFA 2017 in New York",
    "content": "The 18th International Indian Film Academy (IIFA) Awards will be held at the iconic MetLife Stadium in New York City on July 14 and 15. The event had kicked off with the voting process for the awards in April.\nThe award funtion, which will be hosted by Karan Johar and Saif Ali Khan, will be a star-studded affair. Over the years, IIFA has attracted International stars like Angelina Jolie, Jackie Chan, Hilary Swank and Kevin Spacey among others.\nThis year’s event will have a special show to celebrate 25 years of A.R. Rahman, featuring the maestro himslef along with Javed Ali, Benny Dayal, Neeti Mohan, Jonita Gandhi, Diljit Dosanjh, and Haricharan.\nNominations\nAe DIl Hai Mushkil         is leading with eight nominations in various categories including Best Picture, followed by Sushant Singh Rajput-starrer                         M.S. Dhoni: The Untold Story         with seven nominations.\nTop Contenders for the Best Picture category are                         Neerja, Pink, Sultan         and                         Udta Punjab        . The nominees for Best Actor in Leading Role (Male) are Shahid Kapoor for                         Udta Punjab        , Ranbir Kapoor for                         Ae DilHai Mushkil        , Shah Rukh Khan for                         Fan        , Sushant Singh Rajput for                         M.S. Dhoni        , Amitabh Bachchan for                         Pink         and Salman Khan for                         Sultan        . The nominees for Leading Role (Female) are Anushka Sharma for                         Ae Dil Hai Mushkil        , Alia Bhatt for                         Dear Zindagi         and                         UdtaPunjab        , Sonam Kapoor for                         Neerja         and Tapsee Pannu for                         Pink        . The Best Director nominations feature Karan Johar (                        Ae Dil HaiMushkil        ), Neeraj Pandey (                        M.S. Dhoni        ), Ram Madhvani (                        Neerja        ), Aniruddha Roy Chowdhary (                        Pink        ), Ali Abbas Zafar (                        Sultan        ) and Abhishek Chaubey (                        Udta Punjab        ).\nPublished - July 12, 2017 04:13 pm IST\nHindi cinema",
    "published_date": "12 Jul 2017",
    "year": 2017,
    "month": "July",
    "url": "https://www.thehindu.com/entertainment/movies/all-set-for-iifa-2017-in-new-york/article19263765.ece"
}