{
    "headline": "Diplodocus, again",
    "content": "With its walnut-sized brain mounted atop a 26-foot-long telescopic neck, the Diplodocus failed to grasp the the implications of the orange-red shooting star, which was becoming brighter by the hour. He continued to relish the tasty tree-top vegetation, beating his shorter but more vicious competitors. That was 65 million years ago.\nOn July 12, 2017, sitting in the comfy living room in our southern Indian home, my attention was focussed on the TV show, live broadcast of the IIFA (Indian International Film Academy) Award function, held at the ‘brim-filled’ Metlife stadium at New York, with the Bollywood glitterati dancing and prancing about, on a high-voltage digital stage.\nMeanwhile, an event\nI too failed to grasp the implications of an unusual ecological event happening silently on the same day. Some 9,500 miles south of New York, on the northwestern coast of icy Antarctica, the final separation of the ‘Larsen C’ ice shelf was under way.\nI tried search ‘the greatest rift on earth’ and ended up reading one that began behind closed doors in a  Beverly Hills home in Los Angeles, and ended in a private courtroom, where Brad Pitt and Anjelina Jolie separated, upsetting thousands of their fans.\nIn contrast, the MIDAS site representing the U.K.-based Antarctic Research project, tracking the developing rift in Antarctica, had few visitors; ‘Larsen C’ perhaps did not authorise them to use click-bait.\nCaptain Carl Anton Larsen, the master of the Norwegian whaling vessel Jason, was sailing along the icy coast of Antarctica in December 1893.\nThe ice-shelf\nLarsen quickly realised that the shoreline he was looking at was not a real one but a shelf of ice protruding out, like a balcony. The only difference was that the natural icy projection was a billion times larger than a balcony. Extending hundreds of miles  and thousands of square miles in area, the shelf was aptly named the ‘Larsen shelf’. They are designated A to E based on location.\nThe Aqua satellite, armed with MODIS (moderate resolution imaging spectro-radiometer), primarily used to locate and assess water bodies, was the first to pick up a developing crack, a kind of mile-long fault line, in the ice-shelf of Larsen C.\nStarting late-2014, scientists of the National Aeronautics and Space Administration (NASA) working with satellite data tracking the rift found that the defect in the Larsen C was growing steadily. By 2016 the crack became 70 miles long and 300 feet wide. By January 2017 it measured 109 miles in length and 1,500 metres in breadth.\nOn July 12, it broke. The broken shelf, now an official iceberg, was massive, indeed the biggest-ever such iceberg, weighing 1.1 trillion tons and measuring 2,200 square miles.\nThe consequence\nWhat is the consequence of this rift? The detachment of more than one trillion tons of ice shelf, floating out in the open sea, and eventually melting, is expected to result in, well, just nothing. Ocean levels all over the world will not even rise by 1 cm. It’s no doomsday.\nThe extinction of Dodo, the loss of hundreds of hectares of rainforest every year, the Royal Bengal Tiger population inching towards zero — none of this brought humanity close to doomsday. We will still enjoy our cup of hot coffee, drive to office and do our work.\nThe ‘Larsen C’ rift indicates the beginning of a major ecological shift, though. Despite our highly evolved ‘100-billion-neuron’ brain, we have decided to ignore it and munch on our burgers.\nJust like the Diplodocus.\ntinynair@gmail.com\nPublished - October 08, 2017 12:00 am IST",
    "published_date": "8 Oct 2017",
    "year": 2017,
    "month": "October",
    "url": "https://www.thehindu.com/opinion/open-page/diplodocus-again/article19819865.ece"
}