{
    "headline": "Udta Punjab wins big at IIFA awards",
    "content": "The 18th edition of the International Indian Film Academy awards ended on a high with                         Udta Punjab         winning four awards on Saturday night.                         Neerja         and                         Ae Dil Hai Mushkil         won three awards each.\nOver 40,000 people cheered for their favourite Bollywood stars as they walked the IIFA Green Carpet ahead of the awards ceremony at MetLife Stadium in New Jersey.\nThe hosts for the evening, Karan Johar and Saif Ali Khan, kept the audience in splits with great repartee and witty conversations with fellow Bollywood celebrities.\nAlia Bhatt’s debut in IIFA saw her performing to a medley of hit songs from her movies. Sushant Singh Rajput and Kriti Sanon wooed the audience with their crackling chemistry as they jived to retro tracks.\nKatrina Kaif caused a storm on stage with her pulsating performance and Salman Khan danced away to songs from                         Tubelight        .\nShahid Kapoor and Alia Bhatt walked away with the Best Actor awards for their film                         Udta Punjab        . The Best Direction award went to Aniruddha Roy Chowdhury for                         Pink         and                         Neerja         won the award for Best Film. In a special category, Taapsee Pannu won the Woman of the Year award for                         Pink        .\nThe Best Performance in a Negative Role title went to Jim Sarbh for                         Neerja        . Shakun Batra and Ayesha DeVitre won the award for the Best Story for                         Kapoor & Sons        .\nAe Dil Hai Mushkil         dominated the music categories. Pritam took home the Best Music Director honour, the Best Playback Singer (Male) award was taken by Amit Mishra and Amitabh Bhattacharya won the Best Lyricist prize. Tulsi Kumar and Kanika Kapoor shared the Best Playback Singer (Female) honour for                         Airlift         and                         Udta Punjab         respectively.\nVarun Dhawan’s performance in                         Dishoom         earned him the title of Best Actor in a Comic Role. Disha Patani won the Best Debut (Female) award for                         MS Dhoni: The Untold Story         and Diljit Dosanjh took the Best Debut (Male) for                         Udta Punjab        .\nShabani Azmi’s performance in                         Neerja         and Anupam Kher’s work in                         MS Dhoni: The Untold Story         earned them the Best Supporting Actor awards.\n(The writer was in New York on an invitation from the IIFA)\nPublished - July 16, 2017 10:47 pm IST",
    "published_date": "16 Jul 2017",
    "year": 2017,
    "month": "July",
    "url": "https://www.thehindu.com/entertainment/movies/udta-punjab-wins-big-at-iifa-awards/article19290336.ece"
}