{
    "headline": "‘Best performance of my career’ - Sai Praneeth",
    "content": "“This is the best performance of my career,” said B. Sai Praneeth shortly after winning the $350, 000 MetLife BWF Super Series-OUE Singapore Open men’s singles title at the Singapore Indoor Stadium on Sunday.\n“There is nothing like winning the crown,” he told                         The Hindu        , even when compared to his defeats of badminton heavyweights Lee Chong Wei and Taufiq Hidayat.\n“I dedicate this win to my family, Gopi Sir (chief National coach Pullela Gopichand), coaches and support staff at the academy,” he said referring to the institution in Hyderabad where he trains.\nRetracing his steps to the title, the men’s singles world No. 30 said: “After losing the first game, I equalised at seven, 11 and 12. When I got ahead by two points, I got confidence to pull off the victory. I found my rhythm and thereon the going was good,” said the Human Resources Executive with Oil and Natural Gas Corporation (ONGC), posted to Chennai but who trains in his hometown Hyderabad through most of the year.\nDid he regret having to defeat his academy-mate and compatriot Kidambi Srikanth 17-21, 21-17, 21-12 for the title ? “I felt a little bad about playing a fellow-Indian in the final. Srikanth also has big victories in his career and he deserved to be in the final,” said Sai, a B. Com. graduate from St. Joseph’s College, Himayathnagar in Hyderabad, while paying tribute to his opponent in the final.\nWhat’s Praneeth like outside badminton? “I have no memorable achievement outside the sport. I enjoy movies and hanging out with friends,” added the 24-year-old, who won the Canadian Open Grand Prix last year and made the final of the Syed Modi Grand Prix this year.\nPublished - April 16, 2017 08:29 pm IST\nsports event\n                    \n                            /                      \n                        \n                        badminton",
    "published_date": "16 Apr 2017",
    "year": 2017,
    "month": "April",
    "url": "https://www.thehindu.com/sport/other-sports/best-performance-of-my-career/article61795461.ece"
}