{
    "headline": "IIFA 2017 kicks off",
    "content": "Day one of the International Indian Film Academy (IIFA) awards began with the official press conference held at the Metropolitan Ballroom of the Sheraton Times Square Hotel. The event was attended by many film personalities including Salman Khan, Shahid Kapoor, Katrina Kaif, Alia Bhatt, Sushant Singh Rajput, Kriti Sanon and Varun Dhawan among others.\nPrior to this, IIFA also inaugurated its festivities by ringing in the Nasdaq stock exchange bell at Times Square, marking the globalisation of Indian cinema. The Academy rang the bell to announce its support for the Nand Ghar Project, a Public-Private-Partnership (PPP) led by Vedanta Resources, which is listed on the NYSE stock exchange, along with the Government of India to transform Early Childhood Care and Education Centers.\nThis year also saw the introduction of the first-of-its-kind “Shuruaat Gala” Dinner, the IIFA Societal Innovation Summit, a charity fundraiser organized by IIFA in association with The Global Education and Leadership Foundation (TGELF) at The Pierre in New York. It brought together the biggest celebrities from Bollywood and leaders from business, philanthropy, media, education and arts field.\nIn addition to the other events, the Federation of Indian Chambers of Commerce and Industry (FICCI) announced the FICCI-IIFA Global Business Forum which will be held on July 14th, 2017 at the Asia Society. This is an initiative supported by Consulate General of India- New York, the Asia Society and the US-India Business Council (USIBC). This year, the Global Business Forum 2017 will focus on the theme “India and United States: Partners in Progress”, with discussions on India- US commercial relations, with panel sessions focusing on key aspects of the relationship: The future of India-US Economic Partnership, Defense and Security, Manufacturing, Innovation and Entrepreneurship, Media and Entertainment.\nThe press conference was followed by a star-studded IIFA Stomp event at Times Square. While Siddharth Kannan welcomed the New Yorkers and tourists alike, actor Varun Dhawan wooed the audience as he shook a leg to some of the chartbusters of Bollywood. Giving him company were DJ Amann Nagpal, Electronica icon B.R.E.E.D, DJ Nasha who as raised the excitement with their unique music.\nThis was followed by an IIFA Stomp fashion show, with Dia Mirza, Taapsee Pannu, Shilpa Shetty, Neha Dhupia, Disha Patani and Huma Qureshi walking the ramp.\nPublished - July 14, 2017 11:55 am IST",
    "published_date": "14 Jul 2017",
    "year": 2017,
    "month": "July",
    "url": "https://www.thehindu.com/entertainment/movies/iifa-2017-kicks-off/article19276741.ece"
}