{
    "headline": "42 India Post Payments Bank branches to open on Sept. 1",
    "content": "The India Post Payments Bank will be launched in the Maharashtra Postal Circle through the opening of 42 branches and 168 access point on September 1.\nChief Postmaster General H.C. Agrawal in a press conference on Thursday announced that Governor Ch. Vidyasagar Rao would declare the Andheri branch open at a launch ceremony at Raj Bhavan, while Chief Minister Devendra Fadnavis would open the Girgaon branch at a function at the General Post Office.\nUnion and State Ministers and Members of Parliament will open the other branches in Maharashtra. A special stamp on financial inclusion will be released to commemorate the launch. Prime Minister Narendra Modi will inaugurate the nationwide launch of the ₹1,435-crore initiative. The bank’s app will also be launched, which will enable customers to recharge phones and pay bills. The bank will initially have 650 branches and 3,250 access points and facilities will be extended to 1.55 lakh access points by December 31.\nIn Maharashtra, 12,428 accounts were opened till August 27 of the bank, which has been set up under the Department of Posts, Ministry of Communications. The government owns 100% equity in it. Mr. Agrawal said, “The bank will be joining hands with businessmen, cooperative dairies, dealers, dabbawalas and fishermen for the benefit of customers.”\nThree lakh postmen will be trained to provide financial guidance to customers. Departments of Posts has been a pioneer of financial inclusion in the country. It caters to over 40 crore customers with over 17 crore post office savings bank accounts.\nMr. Agrawal said, “The bank’s objectives are to build the most accessible, affordable and trusted bank for the common man and to spearhead the financial inclusion agenda by removing the barriers for the unbanked and under-banked sector of population.”\nAs per the guidelines, the bank will coordinate with financial organisations such as Bajaj Allianz Life Insurance and PNB Metlife Insurance for the distribution of government’s insurance programme. As per rules, payments banks can accept deposits of up to ₹1 lakh per account from individuals and small businesses.\nPublished - August 31, 2018 12:03 am IST\ncourier and postal service",
    "published_date": "31 Aug 2018",
    "year": 2018,
    "month": "August",
    "url": "https://www.thehindu.com/news/cities/mumbai/42-india-post-payments-bank-branches-to-open-on-sept-1/article24824051.ece"
}