{
    "headline": "Worthy of biopics",
    "content": "If biopics are to be believed, reality, with all its vicissitudes, beats imagination. Indian cinema has of late thrown its door open to an array of biopics of men and women with remakable lives for audiences to relive. Mahanati, which released this week, based on Savitri’s life, narrated the making of a genius, and the unfurling of a tragedy.\nNTR and Chiranjeevi, are two other names whose biopics will get a red carpet at the box office when they happen. Also in the making is Yatra, a biopic on the former chief minister Y S Rajasekhar Reddy.\nBiopics are also being proposed on severalsportspersons like PV Sindhu, Saina Nehwal, and their coach Pullela Gopichand. Dhyan Chand, Mithali Raj and Abhinav Bindra are some other names whose stories have attracted auteurs.\nMary Kom and Milkha Singh have proven that India is a treasure trove of attractive stories (too bad Hollywood beat us to Ramanujam’s tale — again a brilliant story outside sports that has twists and turns which can put the most imaginative fiction to shame). In fact, we are only scraping the surface when it comes to inspirational tales that can be adopted for the silver screen. Here are a few names from the distant and the not-so-distant past that could keep the genre of biopics afloat for long. .\nPotti Sreeramulu\n\nChiranjeevi’s                         Sye Raa Narasimha Reddy         turns the spotlight on revolutionaries from this part of the country. ‘Amarajeevi’ Potti Sreeramulu, one of Gandhi’s favourite followers, who went on a hunger strike to persuade the Indian government to form a separate state for the Telugu-speaking population under the Madras Presidency. His death due to fasting led to the declaration of a separate Andhra Pradesh State. Earlier too, Sreeramulu had fasted several times in favour of Dalit rights, a subject that is still relevant today.\nTanguturi Prakasam\n\n\nA sobriquet like ‘Andhra Kesari’ reveals a lot about Andhra’s first chief minister. Tanguturi Prakasham ‘Pantulu’was a successful lawyer and freedom fighter known for his bravado.  he didn’t shirk from taking on even the likes of Nehru and Gandhi. His political life was a roller-coaster and his story has everything — revolution, reforms, debates, ego clashes and the rise-fall-rise pattern of great lives.\nKarnam Malleswari\n(FILES) In this file photo taken, 19 September 2000, Karnam Malleswari from India concentrates to lift during the women's -69kg weightlifting final of the 2000 Summer Olympics in Sydney. As stated in a reprt released, 05 August 2004, India's top woman weightlifter Karnam Malleswari has returned from semi-retirement after shedding extra flab, determined to turn bronze into gold at the Athens Olympics this month.  AFP PHOTO/Patrick HERTZOG\n(FILES) In this file photo taken, 19 September 2000, Karnam Malleswari from India concentrates to lift during the women's -69kg weightlifting final of the 2000 Summer Olympics in Sydney. As stated in a reprt released, 05 August 2004, India's top woman weightlifter Karnam Malleswari has returned from semi-retirement after shedding extra flab, determined to turn bronze into gold at the Athens Olympics this month.  AFP PHOTO/Patrick HERTZOG\nThe first Indian woman to win an Olympic medal — do we need a greater reason for the story of this weightlifter to be told? For someone hailing from a small village like Voosavanipeta in Srikakulam, the journey to world glory in a sport like weightlifting is a tale for the generations. Her greatness lies in the fact that the Olympic medal was just one in a long list of achievements, including a gold in the World Weightlifting Championships.\nAR Rahman\nBollywood music composer and singer AR Rahman performs at IIFA Rocks July 14, 2017 at the MetLife Stadium in East Rutherford, New Jersey during the 18th International Indian Film Academy (IIFA) Festival.  / AFP PHOTO / Jewel SAMAD\nBollywood music composer and singer AR Rahman performs at IIFA Rocks July 14, 2017 at the MetLife Stadium in East Rutherford, New Jersey during the 18th International Indian Film Academy (IIFA) Festival.  / AFP PHOTO / Jewel SAMAD\nThe ‘Mozart of Madras’ and one of Time’s 100 Most Influential People in 2009, AR Rahman, in his glittering career has won everything — the Academy Awards, the Golden Globe, the BAFTA, and the Grammy, not to mention six National Awards. As his title ‘Isai Puyal’ (music storm) suggests, the great man broke onto the scene in his 20s with the genre-bending OST for Roja and Indian music was never the same. Who wouldn’t want to see his story on screen?\nYesudas\n\nCHENNAI : 23-11-2016--  Carnatic singer K J Yesudass  arrives to pays last Respects to Carnatic vocalist, playback singer and composer Mangalamapalli Balamuralikrishna, who passed away  in Chennai.  Photo: K.V. Srinivasan\nCHENNAI : 23-11-2016--  Carnatic singer K J Yesudass  arrives to pays last Respects to Carnatic vocalist, playback singer and composer Mangalamapalli Balamuralikrishna, who passed away  in Chennai.  Photo: K.V. Srinivasan\nHis                         Harivarasanam         is the lullaby played at Sabarimala temple every night to put Lord Ayyappa to sleep. This for a man made to wait for decades to enter some famous temples, owing to his religion, is nothing but a triumph for music. A student of several illustrious greats of Carnatic music, Yesudas, despite financial constraints, rose up to the stature of Gana Gandharvan, recording 80,000 songs over half a century in more than half a dozen languages.\nM Balamuralikrishna\n\nDr. M.Balamuralikrishna Performing during Dasara Celebration at Mysore Palace. PHOTO: M.A.SRIRAM \nPHOTO FOR DISTRICT PLUS Dr. M.Balamuralikrishna Performing during Dasara Celebration at Mysore Palace. PHOTO: M.A.SRIRAM \nPHOTO FOR DISTRICT PLUS - Dr. M.Balamuralikrishna Performing during Dasara Celebration at Mysore Palace. PHOTO: M.A.SRIRAM \nPHOTO FOR DISTRICT PLUS\nDr. M.Balamuralikrishna Performing during Dasara Celebration at Mysore Palace. PHOTO: M.A.SRIRAM \nPHOTO FOR DISTRICT PLUS Dr. M.Balamuralikrishna Performing during Dasara Celebration at Mysore Palace. PHOTO: M.A.SRIRAM \nPHOTO FOR DISTRICT PLUS - Dr. M.Balamuralikrishna Performing during Dasara Celebration at Mysore Palace. PHOTO: M.A.SRIRAM \nPHOTO FOR DISTRICT PLUS\n25000 concerts in a career which started when he was all of six isn’t even the most astounding fact about the great maestro, known not just for his excellence in Carnatic music but for enriching it further with new ragas and an innovative tala system that he created.  If we need a biopic sans drama, just to feel good reminiscing the remarkable achievements of a great man, made Chevalier of the Ordre des Arts et des Lettres by the French Government in 2005, this is the story to behold.\nCK Nayudu\n\n1933:  Indian cricketers Cottari Kanakaiya Nayudu, left (known as C K Nayudu, 1895 - 1967) and Nanik Amarnath Bharadwaj (known as Lala Bharadwaj 1911 - 2000) coming out to bat during the First Test Match against England in Bombay.  (Photo by Central Press/Getty Images)\n1933:  Indian cricketers Cottari Kanakaiya Nayudu, left (known as C K Nayudu, 1895 - 1967) and Nanik Amarnath Bharadwaj (known as Lala Bharadwaj 1911 - 2000) coming out to bat during the First Test Match against England in Bombay.  (Photo by Central Press/Getty Images)\nIn a cricket crazy country, the story of the first captain of the Indian cricket team in Tests is definitely one of interest. Hailed by historians including Ramachandra Guha, Nayudu, a real-life Bhuvan (think                         Lagaan        ) probably captured the imagination of a country with his scintillating knock of 153 in 116 minutes for the Hindus against the MCC Team in the Bombay Gymkhana Grounds. That innings in 1926 probably led to India’s elevation to Test status way before Independence and cricket’s rise in the nation.\nMalli Mastan Babu\nHYDERABAD : 14-11-2006 : Malli Mastan Babu, M. Tech. in Hyderabad on Tuesday. PHOTO: K_RAMESH BABU.\n        If you had loved the critically acclaimed                         127 Hours        , you are bound to find the story of Malli Mastan Babu, who hailed from Nellore, inspiring. After an impressive educational record (an M Tech from IIT Kharagpur and an MBA from IIM Calcutta), Mastan Babu pursued his passion for mountaineering, creating a world record in 2006, as the then fastest Seven Summiteer (climbing the highest mountain peak in each continent, known as Seven Summits, in just 172 days). Bad weather in the Andes led to his tragic demise, at the age of 41, during one of his solo missions.\nHYDERABAD : 14-11-2006 : Malli Mastan Babu, M. Tech. in Hyderabad on Tuesday. PHOTO: K_RAMESH BABU.\nPublished - May 10, 2018 04:09 pm IST\nThe Hindu MetroPlus\n                    \n                            /                      \n                        \n                        Telugu cinema\n                    \n                            /                      \n                        \n                        entertainment (general)",
    "published_date": "10 May 2018",
    "year": 2018,
    "month": "May",
    "url": "https://www.thehindu.com/entertainment/movies/heres-a-look-at-personalities-whose-lives-can-hypothetically-translate-to-engaging-movies/article23837001.ece"
}