{
    "headline": "Everyone knows my strategy, are going to mark me: Sindhu",
    "content": "The newly crowned World champion P.V. Sindhu, the chief guest at PNB MetLife Junior badminton championships here, was oozing with confidence and brimming with joy.\nThe status of world champion is a testament to her rigorous hard work in the last three-four months. After losing five finals, Sindhu was disappointed, but she credited this success to her diligent efforts in every aspect of her game and mental strength.\n“Hard work is the only success mantra, it takes years to achieve what you dream of. I have had my share of ups and downs. Wins make you confident, but losses provoke you to come back stronger,” she said.\nThe 1994 Asian Games gold medallist Kim Ji-hyun has been an influential coach in Sindhu’s development. She was a tactically much-improved player in the Championships in Basel this year.\nSindhu had words of praise for her coach. “Under the guidance of Gopi Sir (P. Gopi Chand) I have been training with Kim. It’s not just one particular stroke, it’s about perfecting every stroke and her impact has been great. We have worked a lot on the front court, back court and defence,” Sindhu said.\nSindhu played with the young kids at the venue, encouraged them and advised them to never give up in life in whatever they do. She stressed that parents should encourage their kids in whatever sport they play.\nShe also indicated that there are many sacrifices one had to make, be it parents or the player. She quoted the example of her parents who shifted with her to a house closer to the Gopi Chand Academy so that she could commute easily and have more time to train.\nTwo bronze and two silver medals in the previous Championships made her a challenging opponent but not a winner. This time she was passionate to win the gold. The status of a world champion comes with an added pressure, every time when you step on the court.\n“After losing the previous two finals I was dejected, but never lost hope. It was a much awaited win. The responsibility to win and pressure to perform will be extra now. Everyone knows my strategy, they are going to mark me. So, now every time I step on the court, I have to come up with a new strategy.”\nShe signed off by saying that kids needed tournaments like these to perform and gain confidence.\nPublished - September 10, 2019 08:53 pm IST\nbadminton",
    "published_date": "10 Sept 2019",
    "year": 2019,
    "month": "September",
    "url": "https://www.thehindu.com/sport/other-sports/everyone-knows-my-strategy-will-mark-me/article29385046.ece"
}