{
    "headline": "Merged PSBs must cut stake in insurers",
    "content": "After the merger of 10 public sector banks (PSBs) into four, two of them will hold over 15% stake in two different insurance companies, individually.\nAccording to insurance regulations, a bank cannot hold more than 15% stake in more than one insurance company.\n“Having more than 15% stake in an insurance company gives the status of the promoter to the entity. One entity cannot be a promoter of two insurance companies,” a senior insurance industry official said. “So, the banks have to completely exit one insurance company or cut stake to 15%,” the official added. Two sets of merger-bound PSBs will hold stakes in two different insurance companies, post the merger. One is Punjab National-Oriental Bank of Commerce-United Bank of India combine and another is the Union Bank-Andhra Bank-Corporation Bank combine.\nIn the first combine both PNB and OBC hold stakes in two different insurers. PNB has a 30% stake in PNB Metlife Life India Insurance Company while OBC holds 23% in Canara-HSBC-OBC Life Insurance. So, the merged entity —  PNB — will hold over 15% stakes in both the  companies.\nIn the second combine, Union Bank holds 25% stake in Star Union Dai-Ichi Life Insurance Company while Andhra Bank holds 30% stake in India-First Life Insurance Company. So, the merged entity — Union Bank — will have more than 15%  in both the life insurers.\nHowever, bank officials said they were not in a hurry to cut stake as that could impact valuations. Banks would wait for an initial public offering (IPO) to offload stakes.\n“We are not in a hurry to sell stake. After the merger, when there is an IPO of one of the companies, we will reduce stake,” said a top official from one of the merger-bound banks.\nBanks will have to get the permission of the Insurance Regulatory and Development Authority of India (IRDAI) — the insurance regulator — for holding over 15% stake in two insurers for a while, that is, till the IPO. Bank mergers are expected to be completed by March 2020 and it is unlikely  insurers would like to hit the capital markets, especially when the markets are choppy.\nInterestingly, PNB Metlife was planning an IPO last year but postponed its plans due to market conditions.\nOBC had also been planning to divest stake in Canara-HSBC-OBC Life Insurance last year but the plan was shelved.\nIDBI Bank, in which LIC has a majority stake, also has an insurance arm in IDBI-Federal Life Insurance  in which it holds 48% stake.\nThe bank has now started the process of exiting the life insurance company.\nPublished - September 07, 2019 10:57 pm IST\nbanking",
    "published_date": "7 Sept 2019",
    "year": 2019,
    "month": "September",
    "url": "https://www.thehindu.com/business/merged-psbs-must-cut-stake-in-insurers/article29363424.ece"
}