{
    "headline": "Sindhu hopes to turn the tide in upcoming tournaments this month",
    "content": "Olympic silver medallist P V Sindhu on Thursday admitted that her season so far has not been “great” but expressed hope of turning the tide in the upcoming events, beginning with Indonesia Open from July 16.\nSindhu has played in six tournaments so far this year without reaching a final. She reached the semifinals in India Open in March and Singapore Open in April.\n“(It) has not been really great. But, it was ok. I am satisfied. But, I think I have to do much better,” Sindhu told reporters on the sidelines of PNB Metlife announcing the launch of Junior Badminton Championship-5.\nAsked what went wrong in the last six months during which she did not win any major tournament, Sindhu said, “Nothing went wrong. But on the day, sometimes, you might not just give your 100 per cent. Sometimes, you might just make too many mistakes.\n“That’s why I said I have to be satisfied. It’s not that I am happy. But, you always have to think that there is always a next time,” she said.\nThe 23-year-old Sindhu said she has worked hard on her game during the one month-long break she got and is confident of doing well in Indonesia, Japan and Thailand.\n“We have got almost one month of break. I have been in my top level and working hard. There has been enough time to prepare for the next three tournaments, that is Indonesia, Japan and Thailand. So, I am confident that I can do well and I can give my 100 per cent,” said the 2016 Olympics silver medallist.\nThe Indonesia Open begins on July 16 while Japan Open and Thailand Open will start on July 23 and July 30.\nDuring the break, she said she has worked on her physical and mental fitness to be in good shape.\n“I have worked on mental as well as physical (fitness). Matches have been really long nowadays. Everything is like a chain where you need to touch up on everything. It’s not just that you do physical and leave the skill part. I think I have been working out on skill a lot more,” she said.\n“Because, now the game has changed a lot. A lot of people have been working out on their skills and physical. I think it is very important to keep yourself fit as well as in your skill work, you need to be very much perfect as well. So, I have been working on that,” she said when asked if she worked on something new.\nShe said the players need to have variation in their game to achieve success in major tournaments.\n“Every time, we need to change. Because, it is not the same every time. Not only you, your opponents change their game,” she said.\n“Now, there are video cameras, there are videos, analysing and doing everything. Even though we go with one strategy, when you go on to court, every point can be comparatively different. That’s what I feel,” she added.\nSindhu said her training with new coaches, who have come a few of months ago, has been good. She is currently training with Korean Kim Ji Hyun and hoped that it would work well for her.\nThe players can learn new techniques from every coach as each one has different thinking and experience, she said.\nSindhu said each tournament is important for her though she aimed to win a medal in the Tokyo Olympics next year.\nPublished - July 04, 2019 06:49 pm IST\nbadminton",
    "published_date": "4 Jul 2019",
    "year": 2019,
    "month": "July",
    "url": "https://www.thehindu.com/sport/other-sports/sindhu-hopes-to-turn-the-tide-in-upcoming-tournaments-this-month/article28284473.ece"
}