{
    "headline": "I’ll be marked now, need to find new strategy every time, says Sindhu",
    "content": "Indian badminton ace P V Sindhu says she will be marked by opponents after her World Championships gold and would need to constantly discover “new things” in her game to maintain her stranglehold on international badminton.\nOlympic silver medallist Sindhu became the first Indian to win a historic World Championships gold medal after thrashing Japan’s Nozomi Okuhara 21-7 21-7 in a lop-sided final at Basel, Switzerland last month.\nAsked about the challenges that she will face from now on, Sindhu, who boasts of two silver and as many bronze in the World Championships, said: “Pressure and responsibility will now be more. I know everybody will mark me now after the World Championship.\n“Now I have to really work harder and change a few things and come with new things because everyone can see my game and know what I am playing. So I have to go with new strategy every time I go into the court,” Sindhu told reporters in New Delhi.\nThe 24-year-old from Hyderabad said the World Championships gold medal took a long time coming and it was a result of hard work, besides all the sacrifices that her parents have made over the years.\n“I have been wanting this gold for five years. I have been losing every time. I also used to feel sad, but I always kept fighting back and working hard. My parents made a lot of sacrifices for me,” she said.\n“Coaches role also has been important. My first coach was Mehboob Ali and then I have been under Gopi sir since I was 10. In badminton, you need to have a strong mindset.”\nSindhu will next play at the China Open World Tour Super 1000 (September 17-22) and Korea Open World Tour Super 500 (September 24-29) at Changzhou and Incheon City respectively.\n“I am preparing for China and Korea Open, I will be leaving in a few days, that is my immediate goal. I hope to give my best,” she said on the sidelines of the PNB MetLife Junior Badminton Championship (JBC).\n“This (gold) medal gave a big boost and I will move with this confidence. There are many events before Olympics, so I will just give 100 percent instead of taking pressure.”\nAsked if there was any pressure ahead of the World Championships final, Sindhu said: “There was no pressure in the final. The quarterfinals was one of the good matches against Tai Tzu.\n“Playing Okuhara, everyone was saying whether I will repeat the 2017 final but for me I was not thinking about that. It was a fresh match for me. We knew each others’ game, as we have played a lot against each other. So there was no particular strategy.”\nNational coach Pullela Gopichand had recently said that India have not “invested enough in coaches”.\nAsked about her opinion on this issue, Sindhu said: “There needs to be high level coaches, where they need to know everything about badminton to create a champion.\n“Of course, Gopi sir himself has been a great player and a great coach. Now we have other coaches from abroad and they are helping us. But national coaches need to be much qualified, then definitely they can train more players and they will become champions.”\nTalking about the role of foreign coach Kim Ji Hyun of Korea, Sindhu said: “For last couple of months, I have been training with Kim under the guidance of Gopi sir. It is not just one stroke, each stroke is important, we have to make each stroke perfect.\n“We have been working on defence and front and back court and that really helped me.”\nSindhu, who felicitated the winners of PNB MetLife Junior Badminton Championship (JBC), also gave a big thumbs-up to the tournament which completed its fifth edition here on Tuesday.\n“It is a great idea and it is encouraging players of grassroot level. The number of participants is increasing and talent is there and we need to have tournaments like this for them to grow,” she said.\n“PNB Metlife is encouraging and supporting each of them.”\nPublished - September 10, 2019 07:52 pm IST\nbadminton",
    "published_date": "10 Sept 2019",
    "year": 2019,
    "month": "September",
    "url": "https://www.thehindu.com/sport/other-sports/ill-be-marked-now-need-to-find-new-strategy-every-time-says-sindhu/article29384735.ece"
}