{
    "headline": "The economic impact of the first leg of Taylor Swift’s Eras Tour | Explained\nPremium",
    "content": "The story so far: On August 31, U.S. musician Taylor Swift announced that her spectacular Eras Tour will premiere as a three-hour movie across theatres in North America on October 13. The tour, currently in its second leg in South America, will travel to Europe and a few spots in Asia before returning to North America in 2024.\nIt is already being touted as the biggest concert tour ever by a musician, predicted to oust the likes of John Lennon, Ed Sheeran and Coldplay.\nMs. Swift first announced 27 shows on November 1, 2022, across 20 cities in the U.S. However, unprecedented public demand led her to expand the first leg of the tour across the U.S. to 53 shows, with the maximum number of shows (six) at the SoFi Stadium in Inglewood, California.\nShe played the first show in Glendale, Arizona on March 17; it was temporarily renamed “Swift City” by Mayor Jerry Weiers in her honour.\nJUST IN - Glendale Mayor temporarily renames the city \"Swift City\" in honor of @taylorswift13 kicking off her Eras Tour March 17th and 18th at State Farm Stadium @abc15pic.twitter.com/F0aUl9vu4k\nOther cities also followed suit – Pittsburgh became Swiftsburgh, Minneapolis became Swiftie-apolis, and Santa Clara was renamed Swiftie Clara. Ms. Swift was also named the honorary mayor of Santa Clara.\nQuestionPro, a U.S.-based survey software company, estimates that the Eras Tour could generate $5 billion in economic impact for the U.S. economy – more than the GDP of 50 countries across the world.\nThe economic impact of the 2023 U.S. leg of Eras Tour\n                                                            | Photo Credit: \n                                QuestionPro data\nThe record for the highest-grossing music tour of all time currently belongs to Elton John who, according to Billboard, capped off his Farewell Yellow Brick Road Tour in July 2023 with $939 million.\nWhen Ms. Swift first announced her tour, Billboard predicted that it could generate more than $300 million. Since then, she almost doubled the number of shows in the U.S. during the first leg and announced international dates for South America, Europe, and Asia.\nAccording to Pollstar, Ms. Swift’s Eras Tour has already surpassed the 2023 collection of the Farewell Yellow Brick Road tour, which started in 2018 and took a break during the COVID-19 pandemic years.\nTickets for Ms. Swift’s Eras Tour shows in the U.S. ranged from $49 to $449, while VIP packages cost $199 to $899. According to Pollstar, the average ticket price for the show was $253.56.\nTickets on resale websites, however, raked in thousands of dollars. Ticketmaster, the official online ticket seller for the Eras Tour, crashed when people first queued up virtually to buy tickets, eventually prompting a Senate hearing over concerns of monopoly of concert ticket sales.\nIn a statement, the company said that over 3.5 million people registered for the presale. “Historically, around 40% of invited fans actually show up and buy tickets, and most purchase an average of 3 tickets. Around 1.5 million people were sent codes to join the onsale for all 52 show dates, including the 47 sold by Ticketmaster. The remaining 2 million were placed on a waiting list,” Ticketmaster said.\nThe company received 3.5 billion total system requests, four times its previous peak. “Never before has a Verified Fan onsale sparked so much attention – or traffic. This disrupted the predictability and reliability that is the hallmark of our Verified Fan platform,” the statement added.\nTicketmaster sold over two million tickets for the Eras Tour on November 15 — the most for an artist on a single day.\nThe non-availability of tickets is a possible reason for exorbitant resale prices.  According to TicketIQ, an event ticket search engine, the average listing price of tickets for the Eras Tour when it was first announced was $2,183 on the secondary market.\nQuestionPro research also suggests that the average attendee spent around $1,300 per show on tickets, merchandise, food and drinks, costumes, travel and other expenses. Around 49% of attendees had household income of less than $50,000, while 25% each fall in the $50,000-$100,000 and over $100,000 categories.\nMost of the Eras Tour shows were sold out, with many tailgating outside venues hoping for resale tickets— calling it “Taylorgating” or “Taygating” after the singer. Stadiums like MetLife in East Rutherford and Gillette in Foxborough specifically asked tailgaters to not hinder traffic and ticket holders.\nNew Jersey, it's almost time! ✨ 💜Swipe to see everything you need to know before heading to MetLife Stadium for @TaylorSwift | The Eras Tour#MetLifeStadium| #TaylorSwift | #TSTheErasTour | #EastRuthTSTheErasTour1/3 pic.twitter.com/2ASqwQojSf\nThe average attendance of Eras Tour concerts was 53,900 according to Pollstar; while CNN, quoting QuestionPro data, said that around 72,459 attended each show on an average.\nMs. Swift broke multiple attendance records during the first U.S. leg of the Eras Tour. In Glendale, she recorded an attendance of over 140,000 people – almost the double of the Super Bowl event held in the same stadium in February 2023.\nAccording to the AT&T Stadium in Arlington, Texas, she became the first-ever artist to perform three straight nights for an attendance record of 210,607.\n.@taylorswift13 became the first artist ever to perform three straight days at AT&T Stadium for a three-day AT&T Stadium attendance record of 210,607.#ATTStadium | #TaylorSwift | #TSTheErasTour | #ArlingtonTSTheErasTourpic.twitter.com/Zno0fxcCBh\nShe also set the record for biggest all-time Nissan Stadium concert attendance record for two nights in a row (since broken by singer Ed Sheeran).\nTake a bow, Swifties! Y'all just set the all-time Nissan Stadium concert attendance record for a SECOND STRAIGHT NIGHT! 😍#TSErasTourNashvillepic.twitter.com/ZxBFlXCtqi\nMs. Swift then went on to set to host record-breaking shows at MetLife Stadium in East Rutherford and Acrisure Stadium in Pittsburgh.\nThe Eras Tour drove businesses in the cities on its circuit, giving local economies a much-needed boost since COVID-19. According to Smith Travel Research (STR) reports, hotels in Eras Tour stops were “bejewelled”, with its impact, with around $208 million in additional U.S. hotel room revenue. This estimate  only records the impact of the concert nights and does not account for extended fan stays and other offshoots.\nPittsburgh and Nashville specifically doubled their revenue per available room (RevPAR) from shoulder weeks. Seattle, which led all host cities in absolute RevPAR ($293), broke its own record on July 22 (the first night of the Eras Tour in the city) with a RevPAR of $317.\nA post shared by Taylor Swift (@taylorswift)\nAverage daily rates (ADR) of concert days ranged from as high as $307 in Seattle to $138 in Houston, STR research said. ADR premiums, however, varied based on the normal seasonal patterns of the markets. Most markets made the best of the opportunity with double-digit ADR gains as the norm, led by Pittsburgh with a 70% increase followed by Nashville with a 51% increase.\nThe contribution of Ms. Swift’s tour to the hotel industry was also noted by the Federal Reserve Bank of Philadelphia. May was the strongest month for hotel revenue in Philadelphia since the pandemic started, “in large part due to an influx of guests for the Taylor Swift concerts in the city,” the bank noted in an official statement.\nChicago also noted a boom in hotel revenues. According to local reports, Illinois Governor J.B. Pritzker announced at a press conference that the State’s hotel revenue for the fiscal year ending June 30 reached $309 million. The pre-pandemic 2019 record was set at $296 million. This was in part due to the Eras Tour as well as the American Society of Clinical Oncology meeting and the James Bear Foundation awards in the city.\nHuge news, Chicago!We've made historic investments in our tourism industry and it's paying off. Let's keep making the whole place shimmer. https://t.co/7fRI4NurJI\nThe Holiday Inn hotel in Glendale was sold out the day the Eras Tour was announced, Business Insider reported, quoting a representative. Other hotels in the vicinity of the State Farm Stadium were also booked to capacity, while the ones that weren’t were available for exorbitant prices, the report added.\nDowntown Cincinnati, where Ms. Swift played two shows on June 30 and July 1, registered more than $2.6 million in hotel revenue for just two days, Visit Cincy reported. Hamilton County, situated at a 20-minute drive from Paycor Stadium where Ms. Swift performed, garnered $5.3 million in the same time period.\nA post shared by Taylor Swift (@taylorswift)\n“The economic impact Ms. Swift creates is staggering, as fans travel from far and wide to attend her concerts, filling hotels, restaurants, and local attractions Swift’s influence on tourism is a testament to her ability to captivate audiences and drive economic growth,” said Julie Calvert, President and CEO of Visit Cincy. Even the tailgate party at The Banks in Cincinnati registered a footfall of 40,691, the report added.\nFriendship bracelets are considered an integral part of the Swiftie experience, and concert attendees also contributed with their creativity.\nMichaels, a multi-city American retail chain for craft supplies  (also celebrating its 50th anniversary this year), saw a more than 40% increase in the jewellery category, which includes jewellery-making kits and materials for friendship bracelets, since mid-April, the company informed The Hindu.\nIn cities where Ms. Swift performed, Michaels noted a whopping 300% increase in sales in categories like beads and jewellery on days leading up to the concerts. Pennsylvania saw the largest jewellery category sales increase among all States – 500% – thanks to  two stops, in Pittsburgh and Philadelphia. The largest single-stop sales increase was noted to be at more than 400% in Detroit, the store said.\n“While we couldn’t have anticipated the trend would take off quite the way it did, our merchandising team was quick to identify it, anticipate what our customers would need, and ensure our stores were well stocked. We also began offering bracelet-making as part of our in-store classes and events, and saw our store teams tap into their own creativity to build special bracelet-making displays that engaged customers,” the company said in a statement.\nMore than 22,000 bracelets were reportedly made as part of the in-store classes. “We saw a large increase in demand for supplies for all kinds of creative projects during the start of the COVID-19 pandemic. However, this was the first instance in recent memory we’ve seen demand spike so acutely around a specific pop culture event and product category,” the statement added.\nBead World, a supplies store in Seattle, said that they registered the highest sales in their 34-year history in July before Ms. Swift was to perform in the city, a local media report said.\nWhile the 2023 U.S. leg of the Eras Tour might be over, there is more to come. The concert movie will be released across theatres in North America on October 13. The announcement was made on August 31 by Ms. Swift on her social media accounts, and people rushed to buy tickets, setting a record for the highest-ever single-day advance ticket sales revenue in the 103-year history of AMC Theatres. The ticket sale generated $26 million in revenue in a day, breaking the previous record of $16.9 million, held by Tom Holland and Zendaya starrer Spider-Man: No Way Home.\nA post shared by Taylor Swift (@taylorswift)\nMs. Swift will now continue the Eras Tour in November 2023 with shows in Argentina and Brazil, before going to Japan, Australia, Singapore, and Europe, and then circling back to North America in late 2024.\nThe Eras Tour also drove up application for United Overseas Bank Ltd.’s credit cards in Singapore, Thailand, Malaysia, Indonesia, and Vietnam by 45% in July compared to the previous month, Bloomberg reported. The bank’s cardholders were eligible for an exclusive presale of Ms. Swift’s concert tickets.\nHotels in Edinburgh, Liverpool, and Cardiff, where the singer is scheduled to play in June and August 2024, are already sold out, TheGuardian reported, quoting Travelodge.\nPublished - September 08, 2023 04:19 pm IST\nThe Hindu Explains\n                    \n                            /                      \n                        \n                        music\n                    \n                            /                      \n                        \n                        Music Personalities\n                    \n                            /                      \n                        \n                        music industry\n                    \n                            /                      \n                        \n                        economy, business and finance\n                    \n                            /                      \n                        \n                        business (general)\n                    \n                            /                      \n                        \n                        Concert\n                    \n                            /                      \n                        \n                        pop music\n                    \n                            /                      \n                        \n                        arts, culture and entertainment",
    "published_date": "8 Sept 2023",
    "year": 2023,
    "month": "September",
    "url": "https://www.thehindu.com/entertainment/music/the-economic-impact-of-the-first-leg-of-taylor-swifts-eras-tour-explained/article67276350.ece"
}