{
    "headline": "Ed Sheeran to return to India for ‘+ - = ÷ x Tour’ in 2024",
    "content": "British singer-songwriter Ed Sheeran is coming back to India and this time, it’s for his ‘+ - = ÷ x’ tour. The India leg of the tour will be the final stop in the Asia Tour and will be held at the Mahalaxmi Racecourse in the heart of Mumbai on March 16th, 2024. Fellow British singer and songwriter Calum Scott will be the special guest on the upcoming tour.\nThe new tour will mark Sheeran’s return to India six years after his outing with the ‘Divide’ Tour in 2017. This comes hot on the heels of his USA tour, where he set multiple attendance records including Los Angeles’ SoFi Stadium and New Jersey’s MetLife Stadium; the latter seeing Sheeran secure the largest single-day concert attendance in the USA, ever. Earlier this year, the four-time Grammy Award-winning artist released two albums, ‘Subtract’ and ‘Autumn Variations’.\nThe upcoming tour will also mark Sheeran’s return to Asia after 2019. Sheeran’s two-hour ‘+ - = ÷ x’ Tour will draw from all of his albums since 2011 – ‘Plus’, ‘Multiply’ (2014), ‘Divide’ (2017), ‘Equals’ (2021) and the new ‘Subtract’, and also includes a song from 2019’s ‘No. 6 Collaborations Project (‘Blow’).\nThe general on-sale of tickets will go live at 3 pm IST on October 27 on BookMyShow and Ed Sheeran’s website.\nPublished - October 20, 2023 12:17 pm IST\nmusic\n                    \n                            /                      \n                        \n                        pop music\n                    \n                            /                      \n                        \n                        music festival\n                    \n                            /                      \n                        \n                        music industry",
    "published_date": "20 Oct 2023",
    "year": 2023,
    "month": "October",
    "url": "https://www.thehindu.com/entertainment/ed-sheeran-to-return-to-india-for-%C3%B7-x-tour-in-2024/article67441718.ece"
}