{
    "headline": "News from the world of Education: June 28, 2023",
    "content": "Rostrum Education organised a seminar to guide students aspiring to apply to top foreign universities and equip them with insights and expert advice for their college application journey.\nXLRI PGDM(GM) recently hosted Gaurav Sharma, Chief People Officer, Hindustan Coca-Cola Beverages (HCCB) for a fireside chat.  In his address, he emphasised the importance of embracing diversity, equity, and inclusion and how this integral to the organisational purpose.\nIndian School of Development Management and Citicorp Finance (India) Limited has launched the Centre for Data Science and Social Impact to leverage data and data science in the social sector by boosting collaboration across research and capacity building, as well as by promoting knowledge sharing.\nAdeeb Wani, a student at Amity University, Mumbai, was selected for the first Cestoball World Cup held in Bengaluru. The tournament featured participation from over 13 countries, with Adeeb representing India.\nDhruv Advani, a student of Aakash BYJU’S from Bengaluru, was selected to represent India at the 34th International Biology Olympiad 2023 to be held in the United Arab Emirates from July 3-11, 2023 at the UAE University.\nAditya Birla Education Trust recently launched Nalanda - Aditya Birla Education Trust, a specialised unit dedicated to holistic and inclusive education. It aims to cater to students who are slow learners or are facing learning difficulties.\nLovely Professional University hosted the 65th annual National Association of Students of Architecture (NASA) Convention. It witnessed over 30 seminars and 60 workshops by more than 100 top architects, providing an opportunity for 4,500 budding architects from around the world to learn and grow.\nS.P. Jain Institute of Management and Research recently hosted the Pan India Symposiums 2023 in collaboration with HCL Tech India Grant and CSRBOX, which brought together industry leaders, policymakers, academicians, and change-makers for panel discussions, workshops, and presentations on sustainable development, ethical leadership, and inclusive growth.\ngreytHR Academy has launched new courses to certify over 1,00,000 young professionals and students. It aims to achieve this through its online LMS platform, Udemy, and by leveraging partnerships with academic institutions.\nCanadian International School IB1 students donated 48 iPads, textbooks, and science supplies to rural students of the Global Vedike School, to ensure access to technology and academic materials, to enhance student learning.\nKIIT World School, Sohna Road, conducted a programme as a part of Nasha Mukt Bharat to create awareness and promote a drug-free environment among students and the village community.\nB.Tech. IT students at Sona College of Technology developed Migrant Care, a mobile application that helps connect migrant labourers, their agents, and police officials to ensure their safety while in Salem district. Workers can send a distress signal or mark themselves as ‘Safe’, which be viewed by police officials in real-time, who can access them through the geolocation feature incorporated in the app.\nDreamtime Learning School launched its Career Pathway Programme in partnership with Michigan Colleges Alliance (the U.S), to encourage students to pursue a holistic approach to lifetime learning.\nSchool of Visual Arts, World University of Design, and The Stainless Gallery organised a workshop Pehchan: A Journey Within Your Creative Self, to engage students.\nOver 100 Class 7 students of Kanakia International School recently spearheaded an e-waste management drive in collaboration with Sanskar India Foundation, collecting 33.3KG of e-waste.\nMediSage is hosting a series of webinars on Competencies in Chronic Care, led by Dr. Sanjay Kalra. It aims to empower PG students and general practitioners with a focus on various endocrinology topics. The next session will be on June 27. For details, visit, https://mymedisage.com\nAcadzo will offer specialised courses on speedy Maths calculations and cube learning to children aged 5 to 14. Acadzo has incorporated interactive games, challenging tasks, and real-world examples in its application.\nStudy Group has announced that four of its university partners — Durham University, Liverpool John Moores University, the University of Sheffield, and the University of Sussex — have subjects in the top 10 of the QS World University Rankings by Subject 2023.\nOrchids The International School inaugurated a new Horticulture facility at its Horamavu branch in Bengaluru. The newly introduced horticulture curriculum, Little Green Fingers, will be taught to students from classes 1 to 10.\nGoa’s Kamaxi College of Culinary Arts has appointed Anna Louvella Pereira as a faculty for its newly introduced Food and Beverage Service Associate Programme.  She has extensive experience in the U.K. and the Philippines, as well as her academic qualifications in hospitality and education.\nJK Lakshmipat University recently commemorated the 90th birth anniversary of its founder, Hari Shankar Singhania, by organising a blood donation camp.\nPrepInsta has launched a SaaS Assessment Tool, Optimus by PrepInsta Prime, to empower colleges and universities in evaluating student performance and potential.\nNEXT IAS has launched Hindi-medium courses for UPSC exams to ensure that Hindi-medium students are not left behind in their preparation.\nJAIN College, part of JAIN (Deemed-to-be University), recently welcomed the second batch of students for its Humanities programme.\nRDC Concrete announced its latest initiative, Project PEUSC (Promoting Education for Underprivileged School Children), which aims to support education initiatives for children from deprived sections of India, covering over 70 schools.\nThird-year NMIMS Indore students — Agyeya Jha, Kanishka Lohar, Anshi Jain, Harsh Jain, Jahnavi Plaiwal, and Anirudha Mahajan — were placed among the top five teams in the Smart India Hackathon, for their project, Cyber Arc – Defensive Arc of the Cyber World.\nMarwadi University, in collaboration with the Gujarat Pollution Control Board, successfully concluded Solution for Waste Reduction national-level hackathon, to help find innovative solutions to waste generation.  The team from Government Engineering College, Valsad (Gujarat), — Kalivarapu Pavan; Venkata Ramana; Kevin Patel — which worked on an innovative solution to convert waste PPMA plastic scrap and converting into a multi-purpose puzzle game, came first.\nThe School of Meaningful Experiences (SoME), launched a mobile app, sPeak, to help people improve their communication skills. Available on android and apple platforms, the app has paid and free courses. Download the app from http://bitly.ws/JoEx or http://bitly.ws/JoEF.\nZamit recently launched a suite of CPD programmes for educators. Certified by Qualifications and Assessments International (QAI), the U.K., and accredited by Regulated Qualifications Framework or RQF, UK, the CPD programmes are in line with the guidelines of the NEP 2020.\nThe University of Portsmouth unveiled its Centre for Cyber and Economic Crime, aimed at addressing the growing global threats and challenges posed by cybercrime and economic offenses.\nAYUDH, the youth wing of Mata Amritanandamayi Math, and Amrita Vishwa Vidyapeetham, conducted a four-day Holistic Leadership Training Programme, in collaboration with the Department of Education, Government of NCT of Delhi, and the State Council for Educational Research and Training.\nTELUS International India recently launched the TELUS International University programme to help its team members and their families attend leading educational institutions in the region to achieve their education goals.\nArmy Institute of Management Kolkata announced 100% Summer Internship Placement Process for its class of 115 students for the full-time MBA programme. Over 60 domestic and international companies, including included ITC Limited, PNB MetLife and Pantaloons, Coal India, Kotak Mahindra, participated.\nNMIMS Bengaluru hosted an orientation programme for its new batch of MBA students.\nSampark Foundation participated in a two-day national conference on Foundational Literacy and Numeracy. Creating the Base for Lifelong Learning: National Conference on Foundational Literacy and Numeracy was organised by the Ministry of Education.\nInternational Yoga Day\nDepartment of Students Welfare and Centre for Yoga, Manav Rachna International Institute of Research and Studies, collaborated with the Ministry of Ayush, Commonwealth Educational Media Centre for Asia, ISHA Foundation, and Brahma Kumaris Ishwariya Vishwa Vidyalaya, to commemorate the International Yoga Day 2023.\nJD Institute of Fashion Technology collaborated with Isha Foundation, to conduct a yoga session.\nAmity University celebrated International Yoga Day on the theme, Yoga for Vasudhaiva Kutumbakam.\nKIIT World School and KIIT College of Education, Gurugram, jointly celebrated International Yoga Day with students performing various asanas.\nAround 250 parents and students of Greenwood High International School participated in the International Yoga Day celebrations.\nMoUs and collaborations\nFORE Academy of Management Education signed an MoU with the Indian Air Force, to reserve 10 seats across all the UG courses for the wards of the Air Force personnel and grant them scholarships.\nThe National Stock Exchange of India Limited and the National Institute of Industrial Engineering, Mumbai, signed an MoU for academic and research collaboration in Finance and Economics.\nICRI and IIS University signed an MoU to produce highly skilled professionals in Aviation and Clinical Research.\nThe Consortium for Technical Education and the Commissionerate of Women and Child Development, Government of Maharashtra, signed an MoU to enhance skill development opportunities for women and children.\nIMS Noida signed an MoU with the Indian Pollution Control Association.\nTeachmint collaborated with Google Cloud to use its flexible, scalable cloud platform to develop, deploy and run the Teachmint Integrated School Platform.\nInformation Technology Learning Hub (ITLH) partnered with ConnectFor. ITLH’s students have undertaken the task of enhancing the digital needs of various NGOs, starting with a focus on making their websites more user-centric.\nNational Skill Development Corporation signed an MoU with Sikkim-based Medhavi Skill University and Hyderabad-based Inter National Institute of Fashion Designing to design, curate and develop new-age short term courses in Fashion Design, Interior Design, and Beauty and Wellness.\nThe Design Village collaborated with École Duperré Paris to broaden the experience and horizons of young designers. Both institutions have agreed to a four-year bilateral international semester exchange to foster academic cooperation between the two parties.\nAshoka University signed an MoU with Université Côte d’Azur, France to foster education and research collaboration in Health Sciences.\nIndian School of Hospitality signed an MoU with ICEX Spain Trade and Investment to evaluate and explore collaborations in hospitality education, gastronomy, and cultural exchange.\nKLH Hyderabad Campus of KL Deemed to be University collaborated with SETU Ireland which aims to conduct cardiovascular research.\nThe Government of Andhra Pradesh and ETS will provide customised English assessments to students in the state’s government schools.\nNews from the IITs and IIMs\nShiv Nadar University Chennai signed an MoU with IIT Bombay to open academic avenues to foster academic excellence, faculty and student exchange, research collaboration, and quality education.\nMax Healthcare Institute Limited signed an MoU with IIT Bombay to encourage research, capacity building and innovation in the healthcare industry.\nResearchers from IIT Guwahati studied the fate and transport of viruses through compacted natural clays for pathogenic waste disposal. The study, published in Langmuir, American Chemical Society journal, was co-authored by Prof. Bharat Venkata Tadikonda, Prof. Sachin Kumar, Himanshu Yadav and Shubham Gaurav.\nIIT Kanpur recently signed an MoU with Laurus Labs to introduce gene therapy assets to the market. It is also offering a special scholarship programme, the Bright Minds Scholarships, for 10 All-India Top 100 rank-holders of JEE Advanced 2023. The institute recently successfully conducted a test flight for cloud seeding.\nA team of researchers at IIT Roorkee developed a coating for disposable paper that is water soluble and can be used in various applications with requirements of food freshness retention and replace plastic coatings commonly used in food-grade packaging papers and paperboards.\nPublished - June 28, 2023 10:38 pm IST\nThe Hindu Education Plus\n                    \n                            /                      \n                        \n                        higher education\n                    \n                            /                      \n                        \n                        careers\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        study abroad\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        universities and colleges",
    "published_date": "28 Jun 2023",
    "year": 2023,
    "month": "June",
    "url": "https://www.thehindu.com/education/news-from-the-world-of-education-june-28-2023/article67020924.ece"
}