{
    "headline": "Trump to lead task force preparing for 2026 World Cup",
    "content": "President Donald Trump created a task force Friday (March 7, 2025) to prepare for the 2026 World Cup, which will bring the globe's premier football tournament to North America at a time when his on-again, off-again tariffs have ratcheted up tensions across the continent.\n“I think it's going to make it more exciting,” Mr. Trump said of playing the World Cup amid sharp rhetoric between leaders of the host nations. “Tension's a good thing.”\nThe task force, which Mr. Trump will chair, will coordinate the federal government's security and planning for the tournament, which is expected to draw millions of tourists to the United States, Canada and Mexico.\n“It's a great honour for our country to have it,” Mr. Trump said of the World Cup after meeting with officials from FIFA, the international football governing body. He said he'd like to attend multiple games.\nPreparations are ramping up across the continent alongside tensions between the United States and its neighbours as Mr. Trump has repeatedly threatened to impose tariffs before backing off, spooking markets and leading to fears of a trade war and economic downturn. He also speaks pejoratively of Canadian Prime Minister Justin Trudeau and muses about Canada becoming a US state, which has boosted national pride north of the border.\nFor 2026, the World Cup will expand to 48 teams playing 104 matches across three nations, the first time the tournament will be split between countries. Seventy-eight of 104 matches will be played in the US, with 13 games each in Mexico and Canada, and as many as six matches a day. The final will be played July 19 at MetLife Stadium in New Jersey.\nFIFA President Gianni Infantino said the task force will ensure that each of the visitors who will travel from around the world “feels safe, feels happy and feels that we are doing something special.”\n“So we're here to create and to make the best show on the planet ever,” Mr. Infantino said. He gave Mr. Trump a personalised game ball and unveiled an elaborate trophy that will go to the winner of the 2025 FIFA Club World Cup, which will pit top football clubs against each other this summer ahead of next year's matchup of national teams.\nMr. Trump later brought Infantino to show off the trophy at the start of a White House cryptocurrency summit. The United States, where football has grown in popularity but remains a niche sport, represents a major growth area for football, he said.\nMr. Infantino likened producing the World Cup to holding three Super Bowls daily for a month, a dizzying security and logistical challenge for the host governments.\nThe Trump administration will face a second test on the global sports stage in 2028, when the summer Olympics will be held in California, the first time the Games will have been in the US since Salt Lake City hosted in 2002.\nPublished - March 08, 2025 08:58 am IST\nUSA\n                    \n                            /                      \n                        \n                        soccer\n                    \n                            /                      \n                        \n                        World Cup",
    "published_date": "8 Mar 2025",
    "year": 2025,
    "month": "March",
    "url": "https://www.thehindu.com/news/international/trump-to-lead-task-force-preparing-for-2026-world-cup/article69305600.ece"
}