{
    "headline": "Northwest Hyderabad leads real estate boom with ₹71,926 crore sales in 2024",
    "content": "Hyderabad’s real estate market witnessed the sale of 65,177 residential units amounting to a total value of ₹ 1.13 lakh crore, according to data revealed by CREDAI Hyderabad in collaboration with CRE Matrix on Tuesday.\nAccording to the report, Northwest Hyderabad emerged as the dominant market, accounting for nearly 70% of total unit sales. The region, which includes Madhapur, Miyapur, Manikonda, Serilingampally, Tellapur, Narsingi, Patancheru and Gandi Maisamma recorded sales of 45,405 units valued at ₹ 71,926 crore.\nSouthwest Hyderabad followed, with 9,109 units sold in areas near Rajiv Gandhi International Airport, Katedan, Attapur and Balapur. The total value of homes sold in this region was ₹29,342 crore.\nIn contrast, eastern parts of Hyderabad recorded comparatively lower sales. Northeast Hyderabad, which includes Tirumalgiri, Alwal, parts of Secunderabad, Cherlapalli, Dammaiguda and Boduppal saw 6,279 units sold totalling ₹ 7,147 crore. Southeast Hyderabad recorded the lowest sales figures with 4,384 units sold for a total value of ₹ 5,522 crore. This region includes LB Nagar, Dilsukhnagar, Vanasthalipuram and Pedda Amberpet.\n“The focus for long has been on the western part of Hyderabad. The government now needs to look east and focus on development there. When the policymakers start moving east, developers will automatically move there. The extreme focus on the western part of Hyderabad has also contributed to growing traffic congestion, as a majority of people are both living and working in that part of the city,” said V. Rajashekar Reddy, President of CREDAI Hyderabad.\nThe report also highlighted trends in the commercial real estate sector. In terms of office space, a demand of 13 million square feet was created, compared to a supply of 12.4 million square feet. The top office transactions included Google leasing 5.5 lakh square feet at Elegans Emperia, followed by Metlife Services East taking 1.5 lakh square feet at Prestige Skypark, HCA Global Services leasing 1.09 lakh square feet at Salarpuria Knowledge Park and Cigna leasing 1.06 lakh square feet at the same location.\nAmong developers, the Phoenix Group led the market with a 70% share, followed by Pranava Group at 17% and Modi Realty at 13%. IT and IT-enabled services (ITES) remained the dominant demand drivers, accounting for 49% of commercial space uptake, followed by healthcare at 18%, BFSI (banking, financial services, and insurance) at 10%, and the automobile sector at 8%.\n“Hyderabad’s commercial real estate sector is undergoing rapid expansion, with total Grade A office stock reaching 151.1 million square feet and 82.9 million square feet currently under construction,” said Jagannath Rao Bandari, General Secretary of CREDAI Hyderabad.\nPublished - February 18, 2025 06:58 pm IST\nTelangana\n                    \n                            /                      \n                        \n                        Hyderabad\n                    \n                            /                      \n                        \n                        real estate\n                    \n                            /                      \n                        \n                        real estate",
    "published_date": "18 Feb 2025",
    "year": 2025,
    "month": "February",
    "url": "https://www.thehindu.com/news/cities/Hyderabad/northwest-hyderabad-leads-real-estate-boom-with-71926-crore-sales-in-2024/article69234172.ece"
}